zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
#define FMC_NOR_MEM_BASE        (AXI_BUS_MEMORY_BASE)              /*!< Base address of : FMC NOR memories  accessible over AXI              */
#define QSPI_MEM_BASE           (AXI_BUS_MEMORY_BASE + 0x10000000UL) /*!< Base address of : QSPI memories  accessible over AXI                 */
#define FMC_NAND_MEM_BASE       (AXI_BUS_MEMORY_BASE + 0x20000000UL) /*!< Base address of : FMC NAND memories  accessible over AXI             */
#define DRAM_MEM_BASE           (AXI_BUS_MEMORY_BASE + 0x60000000UL) /*!< Base address of : DRAM (DDR) over AXI                                */

/*!< Device electronic signature memory map */
#define UID_BASE                  (0x5C005234UL)            /*!< Unique Device ID register base address */
#define PACKAGE_BASE              (0x5C005240UL)            /*!< Package Data register base address */
#define RPN_BASE                  (0x5C005204UL)            /*!< Device Part Number register base address */
#define DV_BASE                   (0x50081000UL)            /*!< Device Version register base address */

/*!< Peripheral memory map */
#define APB1_PERIPH_BASE          (PERIPH_BASE + 0x00000000UL)
#define APB2_PERIPH_BASE          (PERIPH_BASE + 0x04000000UL)
#define AHB2_PERIPH_BASE          (PERIPH_BASE + 0x08000000UL)
#define APB6_PERIPH_BASE          (PERIPH_BASE + 0x0C000000UL)
#define AHB4_PERIPH_BASE          (PERIPH_BASE + 0x10000000UL)
#define APB3_PERIPH_BASE          (PERIPH_BASE + 0x10020000UL)
#define APB_DEBUG_PERIPH_BASE     (PERIPH_BASE + 0x10080000UL)
#define AHB5_PERIPH_BASE          (PERIPH_BASE + 0x14000000UL)
#define GPV_PERIPH_BASE           (PERIPH_BASE + 0x17000000UL)
#define AHB6_PERIPH_BASE          (PERIPH_BASE + 0x18000000UL)
#define APB4_PERIPH_BASE          (PERIPH_BASE + 0x1A000000UL)
#define APB5_PERIPH_BASE          (PERIPH_BASE + 0x1C000000UL)

/*!< APB1 */
#define TIM2_BASE             (APB1_PERIPH_BASE + 0x0000UL)
#define TIM3_BASE             (APB1_PERIPH_BASE + 0x1000UL)
#define TIM4_BASE             (APB1_PERIPH_BASE + 0x2000UL)
#define TIM5_BASE             (APB1_PERIPH_BASE + 0x3000UL)
#define TIM6_BASE             (APB1_PERIPH_BASE + 0x4000UL)
#define TIM7_BASE             (APB1_PERIPH_BASE + 0x5000UL)
#define LPTIM1_BASE           (APB1_PERIPH_BASE + 0x9000UL)
#define SPI2_BASE             (APB1_PERIPH_BASE + 0xB000UL)
#define SPI3_BASE             (APB1_PERIPH_BASE + 0xC000UL)
#define SPDIFRX_BASE          (APB1_PERIPH_BASE + 0xD000UL)
#define USART3_BASE           (APB1_PERIPH_BASE + 0xF000UL)
#define UART4_BASE            (APB1_PERIPH_BASE + 0x10000UL)
#define UART5_BASE            (APB1_PERIPH_BASE + 0x11000UL)
#define I2C1_BASE             (APB1_PERIPH_BASE + 0x12000UL)
#define I2C2_BASE             (APB1_PERIPH_BASE + 0x13000UL)
#define UART7_BASE            (APB1_PERIPH_BASE + 0x18000UL)
#define UART8_BASE            (APB1_PERIPH_BASE + 0x19000UL)

/*!< APB2 */
#define TIM1_BASE             (APB2_PERIPH_BASE + 0x0000UL)
#define TIM8_BASE             (APB2_PERIPH_BASE + 0x1000UL)
#define USART6_BASE           (APB2_PERIPH_BASE + 0x3000UL)
#define SPI1_BASE             (APB2_PERIPH_BASE + 0x4000UL)
#define SAI1_BASE             (APB2_PERIPH_BASE + 0xA000UL)
#define SAI1_Block_A_BASE     (SAI1_BASE + 0x004UL)
#define SAI1_Block_B_BASE     (SAI1_BASE + 0x024UL)
#define SAI2_BASE             (APB2_PERIPH_BASE + 0xB000UL)
#define SAI2_Block_A_BASE     (SAI2_BASE + 0x004UL)
#define SAI2_Block_B_BASE     (SAI2_BASE + 0x024UL)
#define DFSDM1_BASE           (APB2_PERIPH_BASE + 0xD000UL)
#define DFSDM1_Channel0_BASE  (DFSDM1_BASE + 0x00UL)
#define DFSDM1_Channel1_BASE  (DFSDM1_BASE + 0x20UL)
#define DFSDM1_Channel2_BASE  (DFSDM1_BASE + 0x40UL)
#define DFSDM1_Channel3_BASE  (DFSDM1_BASE + 0x60UL)
#define DFSDM1_Filter0_BASE   (DFSDM1_BASE + 0x100UL)
#define DFSDM1_Filter1_BASE   (DFSDM1_BASE + 0x180UL)

/*!< AHB2 */
#define DMA1_BASE             (AHB2_PERIPH_BASE + 0x0000UL)
#define DMA2_BASE             (AHB2_PERIPH_BASE + 0x1000UL)
#define DMAMUX1_BASE          (AHB2_PERIPH_BASE + 0x2000UL)
#define ADC2_BASE             (AHB2_PERIPH_BASE + 0x4000UL)
#define ADC2_COMMON_BASE      (AHB2_PERIPH_BASE + 0x4300UL)
#define DMA3_BASE             (AHB2_PERIPH_BASE + 0x5000UL)
#define DMAMUX2_BASE          (AHB2_PERIPH_BASE + 0x6000UL)
#define USBOTG_BASE           (AHB2_PERIPH_BASE + 0x1000000UL)


/*!< APB6 */
#define USART1_BASE           (APB6_PERIPH_BASE + 0x0000UL)
#define USART2_BASE           (APB6_PERIPH_BASE + 0x1000UL)
#define SPI4_BASE             (APB6_PERIPH_BASE + 0x2000UL)
#define SPI5_BASE             (APB6_PERIPH_BASE + 0x3000UL)
#define I2C3_BASE             (APB6_PERIPH_BASE + 0x4000UL)
#define I2C4_BASE             (APB6_PERIPH_BASE + 0x5000UL)
#define I2C5_BASE             (APB6_PERIPH_BASE + 0x6000UL)
#define TIM12_BASE            (APB6_PERIPH_BASE + 0x7000UL)
#define TIM13_BASE            (APB6_PERIPH_BASE + 0x8000UL)
#define TIM14_BASE            (APB6_PERIPH_BASE + 0x9000UL)
#define TIM15_BASE            (APB6_PERIPH_BASE + 0xA000UL)
#define TIM16_BASE            (APB6_PERIPH_BASE + 0xB000UL)
#define TIM17_BASE            (APB6_PERIPH_BASE + 0xC000UL)

/*!< AHB4 */
#define RCC_BASE              (AHB4_PERIPH_BASE + 0x0000UL)
#define PWR_BASE              (AHB4_PERIPH_BASE + 0x1000UL)
#define GPIOA_BASE            (AHB4_PERIPH_BASE + 0x2000UL)
#define GPIOB_BASE            (AHB4_PERIPH_BASE + 0x3000UL)
#define GPIOC_BASE            (AHB4_PERIPH_BASE + 0x4000UL)
#define GPIOD_BASE            (AHB4_PERIPH_BASE + 0x5000UL)
#define GPIOE_BASE            (AHB4_PERIPH_BASE + 0x6000UL)
#define GPIOF_BASE            (AHB4_PERIPH_BASE + 0x7000UL)
#define GPIOG_BASE            (AHB4_PERIPH_BASE + 0x8000UL)
#define GPIOH_BASE            (AHB4_PERIPH_BASE + 0x9000UL)
#define GPIOI_BASE            (AHB4_PERIPH_BASE + 0xA000UL)
#define AIEC_BASE             (AHB4_PERIPH_BASE + 0xD000UL)
#define AIEC_C1_BASE          (AIEC_BASE + 0x0080UL)
/* Alias EXTI_BASE defined because HAL code not yet reworked with new name AIEC*/
#define EXTI_BASE             AIEC_BASE
#define EXTI_C1_BASE          AIEC_C1_BASE

/*!< APB3 */
#define SYSCFG_BASE           (APB3_PERIPH_BASE + 0x0000UL)
#define LPTIM2_BASE           (APB3_PERIPH_BASE + 0x1000UL)
#define LPTIM3_BASE           (APB3_PERIPH_BASE + 0x2000UL)
#define LPTIM4_BASE           (APB3_PERIPH_BASE + 0x3000UL)
#define LPTIM5_BASE           (APB3_PERIPH_BASE + 0x4000UL)
#define VREFBUF_BASE          (APB3_PERIPH_BASE + 0x5000UL)
#define DTS_BASE              (APB3_PERIPH_BASE + 0x8000UL)
#define PMB_BASE              (APB3_PERIPH_BASE + 0x9000UL)
#define HDP_BASE              (APB3_PERIPH_BASE + 0xA000UL)

/*!< AHB4 _APB_Debug */
#define DBGMCU_BASE           ((uint32_t )0x50081000UL)

