zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
#define ADC_JSQR_JEXTEN_Pos               (7U)
#define ADC_JSQR_JEXTEN_Msk               (0x3UL << ADC_JSQR_JEXTEN_Pos)        /*!< 0x00000180 */
#define ADC_JSQR_JEXTEN                   ADC_JSQR_JEXTEN_Msk                  /*!< ADC external trigger enable and polarity selection for injected channels */
#define ADC_JSQR_JEXTEN_0                 (0x1UL << ADC_JSQR_JEXTEN_Pos)        /*!< 0x00000080 */
#define ADC_JSQR_JEXTEN_1                 (0x2UL << ADC_JSQR_JEXTEN_Pos)        /*!< 0x00000100 */

#define ADC_JSQR_JSQ1_Pos                 (9U)
#define ADC_JSQR_JSQ1_Msk                 (0x1FUL << ADC_JSQR_JSQ1_Pos)         /*!< 0x00003E00 */
#define ADC_JSQR_JSQ1                     ADC_JSQR_JSQ1_Msk                    /*!< ADC 1st conversion in injected sequence */
#define ADC_JSQR_JSQ1_0                   (0x01UL << ADC_JSQR_JSQ1_Pos)         /*!< 0x00000200 */
#define ADC_JSQR_JSQ1_1                   (0x02UL << ADC_JSQR_JSQ1_Pos)         /*!< 0x00000400 */
#define ADC_JSQR_JSQ1_2                   (0x04UL << ADC_JSQR_JSQ1_Pos)         /*!< 0x00000800 */
#define ADC_JSQR_JSQ1_3                   (0x08UL << ADC_JSQR_JSQ1_Pos)         /*!< 0x00001000 */
#define ADC_JSQR_JSQ1_4                   (0x10UL << ADC_JSQR_JSQ1_Pos)         /*!< 0x00002000 */

#define ADC_JSQR_JSQ2_Pos                 (15U)
#define ADC_JSQR_JSQ2_Msk                 (0x1FUL << ADC_JSQR_JSQ2_Pos)         /*!< 0x000F8000 */
#define ADC_JSQR_JSQ2                     ADC_JSQR_JSQ2_Msk                    /*!< ADC 2nd conversion in injected sequence */
#define ADC_JSQR_JSQ2_0                   (0x01UL << ADC_JSQR_JSQ2_Pos)         /*!< 0x00008000 */
#define ADC_JSQR_JSQ2_1                   (0x02UL << ADC_JSQR_JSQ2_Pos)         /*!< 0x00010000 */
#define ADC_JSQR_JSQ2_2                   (0x04UL << ADC_JSQR_JSQ2_Pos)         /*!< 0x00020000 */
#define ADC_JSQR_JSQ2_3                   (0x08UL << ADC_JSQR_JSQ2_Pos)         /*!< 0x00040000 */
#define ADC_JSQR_JSQ2_4                   (0x10UL << ADC_JSQR_JSQ2_Pos)         /*!< 0x00080000 */

#define ADC_JSQR_JSQ3_Pos                 (21U)
#define ADC_JSQR_JSQ3_Msk                 (0x1FUL << ADC_JSQR_JSQ3_Pos)         /*!< 0x03E00000 */
#define ADC_JSQR_JSQ3                     ADC_JSQR_JSQ3_Msk                    /*!< ADC 3rd conversion in injected sequence */
#define ADC_JSQR_JSQ3_0                   (0x01UL << ADC_JSQR_JSQ3_Pos)         /*!< 0x00200000 */
#define ADC_JSQR_JSQ3_1                   (0x02UL << ADC_JSQR_JSQ3_Pos)         /*!< 0x00400000 */
#define ADC_JSQR_JSQ3_2                   (0x04UL << ADC_JSQR_JSQ3_Pos)         /*!< 0x00800000 */
#define ADC_JSQR_JSQ3_3                   (0x08UL << ADC_JSQR_JSQ3_Pos)         /*!< 0x01000000 */
#define ADC_JSQR_JSQ3_4                   (0x10UL << ADC_JSQR_JSQ3_Pos)         /*!< 0x02000000 */

#define ADC_JSQR_JSQ4_Pos                 (27U)
#define ADC_JSQR_JSQ4_Msk                 (0x1FUL << ADC_JSQR_JSQ4_Pos)         /*!< 0xF8000000 */
#define ADC_JSQR_JSQ4                     ADC_JSQR_JSQ4_Msk                    /*!< ADC 4th conversion in injected sequence */
#define ADC_JSQR_JSQ4_0                   (0x01UL << ADC_JSQR_JSQ4_Pos)         /*!< 0x08000000 */
#define ADC_JSQR_JSQ4_1                   (0x02UL << ADC_JSQR_JSQ4_Pos)         /*!< 0x10000000 */
#define ADC_JSQR_JSQ4_2                   (0x04UL << ADC_JSQR_JSQ4_Pos)         /*!< 0x20000000 */
#define ADC_JSQR_JSQ4_3                   (0x08UL << ADC_JSQR_JSQ4_Pos)         /*!< 0x40000000 */
#define ADC_JSQR_JSQ4_4                   (0x10UL << ADC_JSQR_JSQ4_Pos)         /*!< 0x80000000 */

/********************  Bit definition for ADC_OFR1 register  ********************/
#define ADC_OFR1_OFFSET1_Pos              (0U)
#define ADC_OFR1_OFFSET1_Msk              (0xFFFUL << ADC_OFR1_OFFSET1_Pos)        /*!< 0x00000FFF */
#define ADC_OFR1_OFFSET1                  ADC_OFR1_OFFSET1_Msk                    /*!< Data offset y for the channel programmed into bits OFFSETy_CH[4:0] */
#define ADC_OFR1_OFFSET1_0                (0x1UL << ADC_OFR1_OFFSET1_Pos)          /*!< 0x00000001 */
#define ADC_OFR1_OFFSET1_1                (0x2UL << ADC_OFR1_OFFSET1_Pos)          /*!< 0x00000002 */
#define ADC_OFR1_OFFSET1_2                (0x4UL << ADC_OFR1_OFFSET1_Pos)          /*!< 0x00000004 */
#define ADC_OFR1_OFFSET1_3                (0x8UL << ADC_OFR1_OFFSET1_Pos)          /*!< 0x00000008 */
#define ADC_OFR1_OFFSET1_4                (0x10UL << ADC_OFR1_OFFSET1_Pos)         /*!< 0x00000010 */
#define ADC_OFR1_OFFSET1_5                (0x20UL << ADC_OFR1_OFFSET1_Pos)         /*!< 0x00000020 */
#define ADC_OFR1_OFFSET1_6                (0x40UL << ADC_OFR1_OFFSET1_Pos)         /*!< 0x00000040 */
#define ADC_OFR1_OFFSET1_7                (0x80UL << ADC_OFR1_OFFSET1_Pos)         /*!< 0x00000080 */
#define ADC_OFR1_OFFSET1_8                (0x100UL << ADC_OFR1_OFFSET1_Pos)        /*!< 0x00000100 */
#define ADC_OFR1_OFFSET1_9                (0x200UL << ADC_OFR1_OFFSET1_Pos)        /*!< 0x00000200 */
#define ADC_OFR1_OFFSET1_10               (0x400UL << ADC_OFR1_OFFSET1_Pos)        /*!< 0x00000400 */
#define ADC_OFR1_OFFSET1_11               (0x800UL << ADC_OFR1_OFFSET1_Pos)        /*!< 0x00000800 */

#define ADC_OFR1_OFFSETPOS_Pos            (24U)
#define ADC_OFR1_OFFSETPOS_Msk            (0x1UL << ADC_OFR1_OFFSETPOS_Pos)        /*!< 0x01000000 */
#define ADC_OFR1_OFFSETPOS                ADC_OFR1_OFFSETPOS_Msk                  /*!< Positive offset */

#define ADC_OFR1_SATEN_Pos                (25U)
#define ADC_OFR1_SATEN_Msk                (0x1UL << ADC_OFR1_SATEN_Pos)            /*!< 0x02000000 */
#define ADC_OFR1_SATEN                    ADC_OFR1_SATEN_Msk                      /*!< Saturation enable */

#define ADC_OFR1_OFFSET1_CH_Pos           (26U)
#define ADC_OFR1_OFFSET1_CH_Msk           (0x1FUL << ADC_OFR1_OFFSET1_CH_Pos)      /*!< 0x7C000000 */
#define ADC_OFR1_OFFSET1_CH               ADC_OFR1_OFFSET1_CH_Msk                 /*!< Channel selection for the data offset y */
#define ADC_OFR1_OFFSET1_CH_0             (0x1UL << ADC_OFR1_OFFSET1_CH_Pos) /*!< 0x04000000 */
#define ADC_OFR1_OFFSET1_CH_1             (0x2UL << ADC_OFR1_OFFSET1_CH_Pos) /*!< 0x08000000 */
#define ADC_OFR1_OFFSET1_CH_2             (0x4UL << ADC_OFR1_OFFSET1_CH_Pos)/*!< 0x10000000 */
#define ADC_OFR1_OFFSET1_CH_3             (0x8UL << ADC_OFR1_OFFSET1_CH_Pos)/*!< 0x20000000 */
#define ADC_OFR1_OFFSET1_CH_4             (0x10UL << ADC_OFR1_OFFSET1_CH_Pos)/*!< 0x40000000 */

#define ADC_OFR1_OFFSET1_EN_Pos           (31U)
#define ADC_OFR1_OFFSET1_EN_Msk           (0x1UL << ADC_OFR1_OFFSET1_EN_Pos)       /*!< 0x80000000 */
#define ADC_OFR1_OFFSET1_EN               ADC_OFR1_OFFSET1_EN_Msk                 /*!< Offset y enable */

/********************  Bit definition for ADC_OFR2 register  ********************/
#define ADC_OFR2_OFFSET2_Pos              (0U)
#define ADC_OFR2_OFFSET2_Msk              (0xFFFUL << ADC_OFR2_OFFSET2_Pos)     /*!< 0x00000FFF */
#define ADC_OFR2_OFFSET2                  ADC_OFR2_OFFSET2_Msk                 /*!< Data offset y for the channel programmed into bits OFFSETy_CH[4:0] */
#define ADC_OFR2_OFFSET2_0                (0x1UL << ADC_OFR2_OFFSET2_Pos)       /*!< 0x00000001 */
#define ADC_OFR2_OFFSET2_1                (0x2UL << ADC_OFR2_OFFSET2_Pos)       /*!< 0x00000002 */
#define ADC_OFR2_OFFSET2_2                (0x4UL << ADC_OFR2_OFFSET2_Pos)       /*!< 0x00000004 */
#define ADC_OFR2_OFFSET2_3                (0x8UL << ADC_OFR2_OFFSET2_Pos)       /*!< 0x00000008 */
#define ADC_OFR2_OFFSET2_4                (0x10UL << ADC_OFR2_OFFSET2_Pos)      /*!< 0x00000010 */
#define ADC_OFR2_OFFSET2_5                (0x20UL << ADC_OFR2_OFFSET2_Pos)      /*!< 0x00000020 */
#define ADC_OFR2_OFFSET2_6                (0x40UL << ADC_OFR2_OFFSET2_Pos)      /*!< 0x00000040 */
#define ADC_OFR2_OFFSET2_7                (0x80UL << ADC_OFR2_OFFSET2_Pos)      /*!< 0x00000080 */
#define ADC_OFR2_OFFSET2_8                (0x100UL << ADC_OFR2_OFFSET2_Pos)     /*!< 0x00000100 */
#define ADC_OFR2_OFFSET2_9                (0x200UL << ADC_OFR2_OFFSET2_Pos)     /*!< 0x00000200 */
#define ADC_OFR2_OFFSET2_10               (0x400UL << ADC_OFR2_OFFSET2_Pos)     /*!< 0x00000400 */
#define ADC_OFR2_OFFSET2_11               (0x800UL << ADC_OFR2_OFFSET2_Pos)     /*!< 0x00000800 */

#define ADC_OFR2_OFFSETPOS_Pos            (24U)
#define ADC_OFR2_OFFSETPOS_Msk            (0x1UL << ADC_OFR2_OFFSETPOS_Pos)     /*!< 0x01000000 */
#define ADC_OFR2_OFFSETPOS                ADC_OFR2_OFFSETPOS_Msk               /*!< Positive offset */

#define ADC_OFR2_SATEN_Pos                (25U)
#define ADC_OFR2_SATEN_Msk                (0x1UL << ADC_OFR2_SATEN_Pos)         /*!< 0x02000000 */
#define ADC_OFR2_SATEN                    ADC_OFR2_SATEN_Msk                   /*!< Saturation enable */

#define ADC_OFR2_OFFSET2_CH_Pos           (26U)
#define ADC_OFR2_OFFSET2_CH_Msk           (0x1FUL << ADC_OFR2_OFFSET2_CH_Pos)   /*!< 0x7C000000 */
#define ADC_OFR2_OFFSET2_CH               ADC_OFR2_OFFSET2_CH_Msk              /*!< Channel selection for the data offset y */
#define ADC_OFR2_OFFSET2_CH_0             (0x1UL << ADC_OFR2_OFFSET2_CH_Pos)    /*!< 0x04000000 */
#define ADC_OFR2_OFFSET2_CH_1             (0x2UL << ADC_OFR2_OFFSET2_CH_Pos)    /*!< 0x08000000 */
#define ADC_OFR2_OFFSET2_CH_2             (0x4UL << ADC_OFR2_OFFSET2_CH_Pos)    /*!< 0x10000000 */
#define ADC_OFR2_OFFSET2_CH_3             (0x8UL << ADC_OFR2_OFFSET2_CH_Pos)    /*!< 0x20000000 */
#define ADC_OFR2_OFFSET2_CH_4             (0x10UL << ADC_OFR2_OFFSET2_CH_Pos)   /*!< 0x40000000 */

