zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
/********************  Bit definition for DBGMCU_IDCODE register  *************/
#define DBGMCU_IDCODE_DEV_ID_Pos              (0U)
#define DBGMCU_IDCODE_DEV_ID_Msk              (0xFFFUL << DBGMCU_IDCODE_DEV_ID_Pos) /*!< 0x00000FFF */
#define DBGMCU_IDCODE_DEV_ID                  DBGMCU_IDCODE_DEV_ID_Msk
#define DBGMCU_IDCODE_REV_ID_Pos              (16U)
#define DBGMCU_IDCODE_REV_ID_Msk              (0xFFFFUL << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_REV_ID                  DBGMCU_IDCODE_REV_ID_Msk

/********************  Bit definition for DBGMCU_CR register  *****************/
#define DBGMCU_CR_DBG_DBGLP_Pos               (2U)
#define DBGMCU_CR_DBG_DBGLP_Msk               (0x1UL << DBGMCU_CR_DBG_DBGLP_Pos) /*!< 0x00000004 */
#define DBGMCU_CR_DBG_DBGLP                   DBGMCU_CR_DBG_DBGLP_Msk

/********************  Bit definition for APB4FZ register  ************/
#define DBGMCU_APB4_FZ_DBG_IWDG2_STOP_Pos     (2U)
#define DBGMCU_APB4_FZ_DBG_IWDG2_STOP_Msk     (0x1UL << DBGMCU_APB4_FZ_DBG_IWDG2_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU_APB4_FZ_DBG_IWDG2_STOP         DBGMCU_APB4_FZ_DBG_IWDG2_STOP_Msk

/********************  Bit definition for APB1FZ register  ************/
#define DBGMCU_APB1_FZ_DBG_TIM2_STOP_Pos      (0U)
#define DBGMCU_APB1_FZ_DBG_TIM2_STOP_Msk      (0x1UL << DBGMCU_APB1_FZ_DBG_TIM2_STOP_Pos) /*!< 0x00000001 */
#define DBGMCU_APB1_FZ_DBG_TIM2_STOP          DBGMCU_APB1_FZ_DBG_TIM2_STOP_Msk
#define DBGMCU_APB1_FZ_DBG_TIM3_STOP_Pos      (1U)
#define DBGMCU_APB1_FZ_DBG_TIM3_STOP_Msk      (0x1UL << DBGMCU_APB1_FZ_DBG_TIM3_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU_APB1_FZ_DBG_TIM3_STOP          DBGMCU_APB1_FZ_DBG_TIM3_STOP_Msk
#define DBGMCU_APB1_FZ_DBG_TIM4_STOP_Pos      (2U)
#define DBGMCU_APB1_FZ_DBG_TIM4_STOP_Msk      (0x1UL << DBGMCU_APB1_FZ_DBG_TIM4_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU_APB1_FZ_DBG_TIM4_STOP          DBGMCU_APB1_FZ_DBG_TIM4_STOP_Msk
#define DBGMCU_APB1_FZ_DBG_TIM5_STOP_Pos      (3U)
#define DBGMCU_APB1_FZ_DBG_TIM5_STOP_Msk      (0x1UL << DBGMCU_APB1_FZ_DBG_TIM5_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB1_FZ_DBG_TIM5_STOP          DBGMCU_APB1_FZ_DBG_TIM5_STOP_Msk
#define DBGMCU_APB1_FZ_DBG_TIM6_STOP_Pos      (4U)
#define DBGMCU_APB1_FZ_DBG_TIM6_STOP_Msk      (0x1UL << DBGMCU_APB1_FZ_DBG_TIM6_STOP_Pos) /*!< 0x00000010 */
#define DBGMCU_APB1_FZ_DBG_TIM6_STOP          DBGMCU_APB1_FZ_DBG_TIM6_STOP_Msk
#define DBGMCU_APB1_FZ_DBG_TIM7_STOP_Pos      (5U)
#define DBGMCU_APB1_FZ_DBG_TIM7_STOP_Msk      (0x1UL << DBGMCU_APB1_FZ_DBG_TIM7_STOP_Pos) /*!< 0x00000020 */
#define DBGMCU_APB1_FZ_DBG_TIM7_STOP          DBGMCU_APB1_FZ_DBG_TIM7_STOP_Msk
#define DBGMCU_APB1_FZ_DBG_LPTIM1_STOP_Pos    (9U)
#define DBGMCU_APB1_FZ_DBG_LPTIM1_STOP_Msk    (0x1UL << DBGMCU_APB1_FZ_DBG_LPTIM1_STOP_Pos) /*!< 0x00000200 */
#define DBGMCU_APB1_FZ_DBG_LPTIM1_STOP        DBGMCU_APB1_FZ_DBG_LPTIM1_STOP_Msk
#define DBGMCU_APB1_FZ_DBG_I2C1_STOP_Pos      (18U)
#define DBGMCU_APB1_FZ_DBG_I2C1_STOP_Msk      (0x1UL << DBGMCU_APB1_FZ_DBG_I2C1_STOP_Pos) /*!< 0x00040000 */
#define DBGMCU_APB1_FZ_DBG_I2C1_STOP          DBGMCU_APB1_FZ_DBG_I2C1_STOP_Msk
#define DBGMCU_APB1_FZ_DBG_I2C2_STOP_Pos      (19U)
#define DBGMCU_APB1_FZ_DBG_I2C2_STOP_Msk      (0x1UL << DBGMCU_APB1_FZ_DBG_I2C2_STOP_Pos) /*!< 0x00080000 */
#define DBGMCU_APB1_FZ_DBG_I2C2_STOP          DBGMCU_APB1_FZ_DBG_I2C2_STOP_Msk

/********************  Bit definition for APB2FZ register  ************/
#define DBGMCU_APB2_FZ_DBG_TIM1_STOP_Pos      (0U)
#define DBGMCU_APB2_FZ_DBG_TIM1_STOP_Msk      (0x1UL << DBGMCU_APB2_FZ_DBG_TIM1_STOP_Pos) /*!< 0x00000001 */
#define DBGMCU_APB2_FZ_DBG_TIM1_STOP          DBGMCU_APB2_FZ_DBG_TIM1_STOP_Msk
#define DBGMCU_APB2_FZ_DBG_TIM8_STOP_Pos      (1U)
#define DBGMCU_APB2_FZ_DBG_TIM8_STOP_Msk      (0x1UL << DBGMCU_APB2_FZ_DBG_TIM8_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU_APB2_FZ_DBG_TIM8_STOP          DBGMCU_APB2_FZ_DBG_TIM8_STOP_Msk

/********************  Bit definition for APB3FZ register  ************/
#define DBGMCU_APB3_FZ_DBG_LPTIM2_STOP_Pos    (1U)
#define DBGMCU_APB3_FZ_DBG_LPTIM2_STOP_Msk    (0x1UL << DBGMCU_APB3_FZ_DBG_LPTIM2_STOP_Pos) /*!< 0x00000002 */
#define DBGMCU_APB3_FZ_DBG_LPTIM2_STOP        DBGMCU_APB3_FZ_DBG_LPTIM2_STOP_Msk
#define DBGMCU_APB3_FZ_DBG_LPTIM3_STOP_Pos    (2U)
#define DBGMCU_APB3_FZ_DBG_LPTIM3_STOP_Msk    (0x1UL << DBGMCU_APB3_FZ_DBG_LPTIM3_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU_APB3_FZ_DBG_LPTIM3_STOP        DBGMCU_APB3_FZ_DBG_LPTIM3_STOP_Msk
#define DBGMCU_APB3_FZ_DBG_LPTIM4_STOP_Pos    (3U)
#define DBGMCU_APB3_FZ_DBG_LPTIM4_STOP_Msk    (0x1UL << DBGMCU_APB3_FZ_DBG_LPTIM4_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB3_FZ_DBG_LPTIM4_STOP        DBGMCU_APB3_FZ_DBG_LPTIM4_STOP_Msk
#define DBGMCU_APB3_FZ_DBG_LPTIM5_STOP_Pos    (4U)
#define DBGMCU_APB3_FZ_DBG_LPTIM5_STOP_Msk    (0x1UL << DBGMCU_APB3_FZ_DBG_LPTIM5_STOP_Pos) /*!< 0x00000010 */
#define DBGMCU_APB3_FZ_DBG_LPTIM5_STOP        DBGMCU_APB3_FZ_DBG_LPTIM5_STOP_Msk

/********************  Bit definition for APB5FZ register  ************/
#define DBGMCU_APB5_FZ_DBG_IWDG1_STOP_Pos     (3U)
#define DBGMCU_APB5_FZ_DBG_IWDG1_STOP_Msk     (0x1UL << DBGMCU_APB5_FZ_DBG_IWDG1_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB5_FZ_DBG_IWDG1_STOP         DBGMCU_APB5_FZ_DBG_IWDG1_STOP_Msk
#define DBGMCU_APB5_FZ_DBG_RTC_STOP_Pos       (4U)
#define DBGMCU_APB5_FZ_DBG_RTC_STOP_Msk       (0x1UL << DBGMCU_APB5_FZ_DBG_RTC_STOP_Pos) /*!< 0x00000010 */
#define DBGMCU_APB5_FZ_DBG_RTC_STOP           DBGMCU_APB5_FZ_DBG_RTC_STOP_Msk

/********************  Bit definition for APB6FZ register  ************/
#define DBGMCU_APB6_FZ_DBG_I2C3_STOP_Pos      (4U)
#define DBGMCU_APB6_FZ_DBG_I2C3_STOP_Msk      (0x1UL << DBGMCU_APB6_FZ_DBG_I2C3_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU_APB6_FZ_DBG_I2C3_STOP          DBGMCU_APB6_FZ_DBG_I2C3_STOP_Msk
#define DBGMCU_APB6_FZ_DBG_I2C4_STOP_Pos      (5U)
#define DBGMCU_APB6_FZ_DBG_I2C4_STOP_Msk      (0x1UL << DBGMCU_APB6_FZ_DBG_I2C4_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU_APB6_FZ_DBG_I2C4_STOP          DBGMCU_APB6_FZ_DBG_I2C4_STOP_Msk
#define DBGMCU_APB6_FZ_DBG_I2C5_STOP_Pos      (6U)
#define DBGMCU_APB6_FZ_DBG_I2C5_STOP_Msk      (0x1UL << DBGMCU_APB6_FZ_DBG_I2C5_STOP_Pos) /*!< 0x00000004 */
#define DBGMCU_APB6_FZ_DBG_I2C5_STOP          DBGMCU_APB6_FZ_DBG_I2C5_STOP_Msk
#define DBGMCU_APB6_FZ_DBG_TIM12_STOP_Pos     (7U)
#define DBGMCU_APB6_FZ_DBG_TIM12_STOP_Msk     (0x1UL << DBGMCU_APB6_FZ_DBG_TIM12_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB6_FZ_DBG_TIM12_STOP         DBGMCU_APB6_FZ_DBG_TIM12_STOP_Msk
#define DBGMCU_APB6_FZ_DBG_TIM13_STOP_Pos     (8U)
#define DBGMCU_APB6_FZ_DBG_TIM13_STOP_Msk     (0x1UL << DBGMCU_APB6_FZ_DBG_TIM13_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB6_FZ_DBG_TIM13_STOP         DBGMCU_APB6_FZ_DBG_TIM13_STOP_Msk
#define DBGMCU_APB6_FZ_DBG_TIM14_STOP_Pos     (9U)
#define DBGMCU_APB6_FZ_DBG_TIM14_STOP_Msk     (0x1UL << DBGMCU_APB6_FZ_DBG_TIM14_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB6_FZ_DBG_TIM14_STOP         DBGMCU_APB6_FZ_DBG_TIM14_STOP_Msk
#define DBGMCU_APB6_FZ_DBG_TIM15_STOP_Pos     (10U)
#define DBGMCU_APB6_FZ_DBG_TIM15_STOP_Msk     (0x1UL << DBGMCU_APB6_FZ_DBG_TIM15_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB6_FZ_DBG_TIM15_STOP         DBGMCU_APB6_FZ_DBG_TIM15_STOP_Msk
#define DBGMCU_APB6_FZ_DBG_TIM16_STOP_Pos     (11U)
#define DBGMCU_APB6_FZ_DBG_TIM16_STOP_Msk     (0x1UL << DBGMCU_APB6_FZ_DBG_TIM16_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB6_FZ_DBG_TIM16_STOP         DBGMCU_APB6_FZ_DBG_TIM16_STOP_Msk
#define DBGMCU_APB6_FZ_DBG_TIM17_STOP_Pos     (12U)
#define DBGMCU_APB6_FZ_DBG_TIM17_STOP_Msk     (0x1UL << DBGMCU_APB6_FZ_DBG_TIM17_STOP_Pos) /*!< 0x00000008 */
#define DBGMCU_APB6_FZ_DBG_TIM17_STOP         DBGMCU_APB6_FZ_DBG_TIM17_STOP_Msk

/******************************************************************************/
/*                                                                            */
/*                    DDRCTRL block description (DDRCTRL)                     */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for DDRCTRL_MSTR register  *****************/
#define DDRCTRL_MSTR_DDR3_Pos              (0U)
#define DDRCTRL_MSTR_DDR3_Msk              (0x1UL << DDRCTRL_MSTR_DDR3_Pos)              /*!< 0x00000001 */
#define DDRCTRL_MSTR_DDR3                  DDRCTRL_MSTR_DDR3_Msk                        /*!< Selects DDR3 SDRAM */
#define DDRCTRL_MSTR_LPDDR2_Pos            (2U)
#define DDRCTRL_MSTR_LPDDR2_Msk            (0x1UL << DDRCTRL_MSTR_LPDDR2_Pos)            /*!< 0x00000004 */
#define DDRCTRL_MSTR_LPDDR2                DDRCTRL_MSTR_LPDDR2_Msk                      /*!< Selects LPDDR2 SDRAM */
#define DDRCTRL_MSTR_LPDDR3_Pos            (3U)
#define DDRCTRL_MSTR_LPDDR3_Msk            (0x1UL << DDRCTRL_MSTR_LPDDR3_Pos)            /*!< 0x00000008 */
#define DDRCTRL_MSTR_LPDDR3                DDRCTRL_MSTR_LPDDR3_Msk                      /*!< Selects LPDDR3 SDRAM */
#define DDRCTRL_MSTR_BURSTCHOP_Pos         (9U)
#define DDRCTRL_MSTR_BURSTCHOP_Msk         (0x1UL << DDRCTRL_MSTR_BURSTCHOP_Pos)         /*!< 0x00000200 */
#define DDRCTRL_MSTR_BURSTCHOP             DDRCTRL_MSTR_BURSTCHOP_Msk                   /*!< When set, enable burst-chop (BC4 or 8 on-the-fly) in DDR3/DDR4. the burst-chop for Reads is exercised only in HIF configurations (UMCTL2_INCL_ARB not set) and if in full bus width mode (MSTR.data_bus_width = 00) and if MEMC_BURST_LENGTH=8 or 16. The burst-chop for writes is exercised only if partial writes enabled (UMCTL2_PARTIAL_WR=1) and if CRC is disabled (CRCPARCTL1.crc_enable = 0). */
#define DDRCTRL_MSTR_EN_2T_TIMING_MODE_Pos (10U)
#define DDRCTRL_MSTR_EN_2T_TIMING_MODE_Msk (0x1UL << DDRCTRL_MSTR_EN_2T_TIMING_MODE_Pos) /*!< 0x00000400 */
#define DDRCTRL_MSTR_EN_2T_TIMING_MODE     DDRCTRL_MSTR_EN_2T_TIMING_MODE_Msk           /*!< If 1, then the DDRCTRL uses 2T timing. Otherwise, uses 1T timing. In 2T timing, all command signals (except chip select) are held for 2 clocks on the SDRAM bus. The chip select is asserted on the second cycle of the command */
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_Pos    (12U)
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_Msk    (0x3UL << DDRCTRL_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00003000 */
#define DDRCTRL_MSTR_DATA_BUS_WIDTH        DDRCTRL_MSTR_DATA_BUS_WIDTH_Msk              /*!< Selects proportion of DQ bus width that is used by the SDRAM */
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_0      (0x1UL << DDRCTRL_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00001000 */
#define DDRCTRL_MSTR_DATA_BUS_WIDTH_1      (0x2UL << DDRCTRL_MSTR_DATA_BUS_WIDTH_Pos)    /*!< 0x00002000 */
#define DDRCTRL_MSTR_DLL_OFF_MODE_Pos      (15U)
#define DDRCTRL_MSTR_DLL_OFF_MODE_Msk      (0x1UL << DDRCTRL_MSTR_DLL_OFF_MODE_Pos)      /*!< 0x00008000 */
#define DDRCTRL_MSTR_DLL_OFF_MODE          DDRCTRL_MSTR_DLL_OFF_MODE_Msk                /*!< Set to 1 when the DDRCTRL and DRAM has to be put in DLL-off mode for low frequency operation. */
#define DDRCTRL_MSTR_BURST_RDWR_Pos        (16U)
#define DDRCTRL_MSTR_BURST_RDWR_Msk        (0xFUL << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x000F0000 */
#define DDRCTRL_MSTR_BURST_RDWR            DDRCTRL_MSTR_BURST_RDWR_Msk                  /*!< SDRAM burst length used: */
#define DDRCTRL_MSTR_BURST_RDWR_0          (0x1UL << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x00010000 */
#define DDRCTRL_MSTR_BURST_RDWR_1          (0x2UL << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x00020000 */
#define DDRCTRL_MSTR_BURST_RDWR_2          (0x4UL << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x00040000 */
#define DDRCTRL_MSTR_BURST_RDWR_3          (0x8UL << DDRCTRL_MSTR_BURST_RDWR_Pos)        /*!< 0x00080000 */

/*****************  Bit definition for DDRCTRL_STAT register  *****************/
#define DDRCTRL_STAT_OPERATING_MODE_Pos        (0U)
#define DDRCTRL_STAT_OPERATING_MODE_Msk        (0x7UL << DDRCTRL_STAT_OPERATING_MODE_Pos)        /*!< 0x00000007 */
#define DDRCTRL_STAT_OPERATING_MODE            DDRCTRL_STAT_OPERATING_MODE_Msk                  /*!< Operating mode. This is 3-bits wide in configurations with mDDR/LPDDR2/LPDDR3/LPDDR4/DDR4 support and 2-bits in all other configurations. */
#define DDRCTRL_STAT_OPERATING_MODE_0          (0x1UL << DDRCTRL_STAT_OPERATING_MODE_Pos)        /*!< 0x00000001 */
#define DDRCTRL_STAT_OPERATING_MODE_1          (0x2UL << DDRCTRL_STAT_OPERATING_MODE_Pos)        /*!< 0x00000002 */
#define DDRCTRL_STAT_OPERATING_MODE_2          (0x4UL << DDRCTRL_STAT_OPERATING_MODE_Pos)        /*!< 0x00000004 */
#define DDRCTRL_STAT_SELFREF_TYPE_Pos          (4U)
#define DDRCTRL_STAT_SELFREF_TYPE_Msk          (0x3UL << DDRCTRL_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000030 */
#define DDRCTRL_STAT_SELFREF_TYPE              DDRCTRL_STAT_SELFREF_TYPE_Msk                    /*!< Flags if Self Refresh (except LPDDR4) or SR-Powerdown (LPDDR4) is entered and if it was under Automatic Self Refresh control only or not. */
#define DDRCTRL_STAT_SELFREF_TYPE_0            (0x1UL << DDRCTRL_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000010 */
#define DDRCTRL_STAT_SELFREF_TYPE_1            (0x2UL << DDRCTRL_STAT_SELFREF_TYPE_Pos)          /*!< 0x00000020 */
#define DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY_Pos (12U)
#define DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY_Msk (0x1UL << DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY_Pos) /*!< 0x00001000 */
#define DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY     DDRCTRL_STAT_SELFREF_CAM_NOT_EMPTY_Msk           /*!< Self refresh with CAMs not empty. Set to 1 when Self Refresh is entered but CAMs are not drained. Cleared after exiting Self Refresh. */

/***************  Bit definition for DDRCTRL_MRCTRL0 register  ****************/
#define DDRCTRL_MRCTRL0_MR_TYPE_Pos (0U)
#define DDRCTRL_MRCTRL0_MR_TYPE_Msk (0x1UL << DDRCTRL_MRCTRL0_MR_TYPE_Pos) /*!< 0x00000001 */
#define DDRCTRL_MRCTRL0_MR_TYPE     DDRCTRL_MRCTRL0_MR_TYPE_Msk           /*!< Indicates whether the mode register operation is read or write. Only used for LPDDR2/LPDDR3/LPDDR4/DDR4. */
#define DDRCTRL_MRCTRL0_MR_RANK_Pos (4U)
#define DDRCTRL_MRCTRL0_MR_RANK_Msk (0x1UL << DDRCTRL_MRCTRL0_MR_RANK_Pos) /*!< 0x00000010 */
#define DDRCTRL_MRCTRL0_MR_RANK     DDRCTRL_MRCTRL0_MR_RANK_Msk           /*!< Controls which rank is accessed by MRCTRL0.mr_wr. Normally, it is desired to access all ranks, so all bits should be set to 1. However, for multi-rank UDIMMs/RDIMMs/LRDIMMs which implement address mirroring, it may be necessary to access ranks individually. */
#define DDRCTRL_MRCTRL0_MR_ADDR_Pos (12U)
#define DDRCTRL_MRCTRL0_MR_ADDR_Msk (0xFUL << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x0000F000 */
#define DDRCTRL_MRCTRL0_MR_ADDR     DDRCTRL_MRCTRL0_MR_ADDR_Msk           /*!< Address of the mode register that is to be written to. */
#define DDRCTRL_MRCTRL0_MR_ADDR_0   (0x1UL << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x00001000 */
#define DDRCTRL_MRCTRL0_MR_ADDR_1   (0x2UL << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x00002000 */
#define DDRCTRL_MRCTRL0_MR_ADDR_2   (0x4UL << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x00004000 */
#define DDRCTRL_MRCTRL0_MR_ADDR_3   (0x8UL << DDRCTRL_MRCTRL0_MR_ADDR_Pos) /*!< 0x00008000 */
#define DDRCTRL_MRCTRL0_MR_WR_Pos   (31U)
#define DDRCTRL_MRCTRL0_MR_WR_Msk   (0x1UL << DDRCTRL_MRCTRL0_MR_WR_Pos)   /*!< 0x80000000 */
#define DDRCTRL_MRCTRL0_MR_WR       DDRCTRL_MRCTRL0_MR_WR_Msk             /*!< Setting this register bit to 1 triggers a mode register read or write operation. When the MR operation is complete, the DDRCTRL automatically clears this bit. The other register fields of this register must be written in a separate APB transaction, before setting this mr_wr bit. It is recommended NOT to set this signal if in Init, Deep power-down or MPSM operating modes. */

/***************  Bit definition for DDRCTRL_MRCTRL1 register  ****************/
#define DDRCTRL_MRCTRL1_MR_DATA_Pos (0U)
#define DDRCTRL_MRCTRL1_MR_DATA_Msk (0xFFFFUL << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x0000FFFF */
#define DDRCTRL_MRCTRL1_MR_DATA     DDRCTRL_MRCTRL1_MR_DATA_Msk              /*!< Mode register write data for all non-LPDDR2/non-LPDDR3/non-LPDDR4 modes. */
#define DDRCTRL_MRCTRL1_MR_DATA_0   (0x1UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)    /*!< 0x00000001 */
#define DDRCTRL_MRCTRL1_MR_DATA_1   (0x2UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)    /*!< 0x00000002 */
#define DDRCTRL_MRCTRL1_MR_DATA_2   (0x4UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)    /*!< 0x00000004 */
#define DDRCTRL_MRCTRL1_MR_DATA_3   (0x8UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)    /*!< 0x00000008 */
#define DDRCTRL_MRCTRL1_MR_DATA_4   (0x10UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)   /*!< 0x00000010 */
#define DDRCTRL_MRCTRL1_MR_DATA_5   (0x20UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)   /*!< 0x00000020 */
#define DDRCTRL_MRCTRL1_MR_DATA_6   (0x40UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)   /*!< 0x00000040 */
#define DDRCTRL_MRCTRL1_MR_DATA_7   (0x80UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)   /*!< 0x00000080 */
#define DDRCTRL_MRCTRL1_MR_DATA_8   (0x100UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)  /*!< 0x00000100 */
#define DDRCTRL_MRCTRL1_MR_DATA_9   (0x200UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)  /*!< 0x00000200 */
#define DDRCTRL_MRCTRL1_MR_DATA_10  (0x400UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)  /*!< 0x00000400 */
#define DDRCTRL_MRCTRL1_MR_DATA_11  (0x800UL << DDRCTRL_MRCTRL1_MR_DATA_Pos)  /*!< 0x00000800 */
#define DDRCTRL_MRCTRL1_MR_DATA_12  (0x1000UL << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x00001000 */
#define DDRCTRL_MRCTRL1_MR_DATA_13  (0x2000UL << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x00002000 */
#define DDRCTRL_MRCTRL1_MR_DATA_14  (0x4000UL << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x00004000 */
#define DDRCTRL_MRCTRL1_MR_DATA_15  (0x8000UL << DDRCTRL_MRCTRL1_MR_DATA_Pos) /*!< 0x00008000 */

