zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
/****************  Bit definition for DDRCTRL_INIT0 register  *****************/
#define DDRCTRL_INIT0_PRE_CKE_X1024_Pos  (0U)
#define DDRCTRL_INIT0_PRE_CKE_X1024_Msk  (0xFFFUL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)  /*!< 0x00000FFF */
#define DDRCTRL_INIT0_PRE_CKE_X1024      DDRCTRL_INIT0_PRE_CKE_X1024_Msk              /*!< Cycles to wait after reset before driving CKE high to start the SDRAM initialization sequence. */
#define DDRCTRL_INIT0_PRE_CKE_X1024_0    (0x1UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)    /*!< 0x00000001 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_1    (0x2UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)    /*!< 0x00000002 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_2    (0x4UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)    /*!< 0x00000004 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_3    (0x8UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)    /*!< 0x00000008 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_4    (0x10UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)   /*!< 0x00000010 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_5    (0x20UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)   /*!< 0x00000020 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_6    (0x40UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)   /*!< 0x00000040 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_7    (0x80UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)   /*!< 0x00000080 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_8    (0x100UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)  /*!< 0x00000100 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_9    (0x200UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)  /*!< 0x00000200 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_10   (0x400UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)  /*!< 0x00000400 */
#define DDRCTRL_INIT0_PRE_CKE_X1024_11   (0x800UL << DDRCTRL_INIT0_PRE_CKE_X1024_Pos)  /*!< 0x00000800 */
#define DDRCTRL_INIT0_POST_CKE_X1024_Pos (16U)
#define DDRCTRL_INIT0_POST_CKE_X1024_Msk (0x3FFUL << DDRCTRL_INIT0_POST_CKE_X1024_Pos) /*!< 0x03FF0000 */
#define DDRCTRL_INIT0_POST_CKE_X1024     DDRCTRL_INIT0_POST_CKE_X1024_Msk             /*!< Cycles to wait after driving CKE high to start the SDRAM initialization sequence. */
#define DDRCTRL_INIT0_POST_CKE_X1024_0   (0x1UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos)   /*!< 0x00010000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_1   (0x2UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos)   /*!< 0x00020000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_2   (0x4UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos)   /*!< 0x00040000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_3   (0x8UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos)   /*!< 0x00080000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_4   (0x10UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos)  /*!< 0x00100000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_5   (0x20UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos)  /*!< 0x00200000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_6   (0x40UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos)  /*!< 0x00400000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_7   (0x80UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos)  /*!< 0x00800000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_8   (0x100UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos) /*!< 0x01000000 */
#define DDRCTRL_INIT0_POST_CKE_X1024_9   (0x200UL << DDRCTRL_INIT0_POST_CKE_X1024_Pos) /*!< 0x02000000 */
#define DDRCTRL_INIT0_SKIP_DRAM_INIT_Pos (30U)
#define DDRCTRL_INIT0_SKIP_DRAM_INIT_Msk (0x3UL << DDRCTRL_INIT0_SKIP_DRAM_INIT_Pos)   /*!< 0xC0000000 */
#define DDRCTRL_INIT0_SKIP_DRAM_INIT     DDRCTRL_INIT0_SKIP_DRAM_INIT_Msk             /*!< If lower bit is enabled the SDRAM initialization routine is skipped. The upper bit decides what state the controller starts up in when reset is removed */
#define DDRCTRL_INIT0_SKIP_DRAM_INIT_0   (0x1UL << DDRCTRL_INIT0_SKIP_DRAM_INIT_Pos)   /*!< 0x40000000 */
#define DDRCTRL_INIT0_SKIP_DRAM_INIT_1   (0x2UL << DDRCTRL_INIT0_SKIP_DRAM_INIT_Pos)   /*!< 0x80000000 */

/****************  Bit definition for DDRCTRL_INIT1 register  *****************/
#define DDRCTRL_INIT1_PRE_OCD_X32_Pos     (0U)
#define DDRCTRL_INIT1_PRE_OCD_X32_Msk     (0xFUL << DDRCTRL_INIT1_PRE_OCD_X32_Pos)       /*!< 0x0000000F */
#define DDRCTRL_INIT1_PRE_OCD_X32         DDRCTRL_INIT1_PRE_OCD_X32_Msk                 /*!< Wait period before driving the OCD complete command to SDRAM. */
#define DDRCTRL_INIT1_PRE_OCD_X32_0       (0x1UL << DDRCTRL_INIT1_PRE_OCD_X32_Pos)       /*!< 0x00000001 */
#define DDRCTRL_INIT1_PRE_OCD_X32_1       (0x2UL << DDRCTRL_INIT1_PRE_OCD_X32_Pos)       /*!< 0x00000002 */
#define DDRCTRL_INIT1_PRE_OCD_X32_2       (0x4UL << DDRCTRL_INIT1_PRE_OCD_X32_Pos)       /*!< 0x00000004 */
#define DDRCTRL_INIT1_PRE_OCD_X32_3       (0x8UL << DDRCTRL_INIT1_PRE_OCD_X32_Pos)       /*!< 0x00000008 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos (16U)
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_Msk (0x1FFUL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos) /*!< 0x01FF0000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024     DDRCTRL_INIT1_DRAM_RSTN_X1024_Msk             /*!< Number of cycles to assert SDRAM reset signal during init sequence. */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_0   (0x1UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos)   /*!< 0x00010000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_1   (0x2UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos)   /*!< 0x00020000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_2   (0x4UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos)   /*!< 0x00040000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_3   (0x8UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos)   /*!< 0x00080000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_4   (0x10UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos)  /*!< 0x00100000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_5   (0x20UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos)  /*!< 0x00200000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_6   (0x40UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos)  /*!< 0x00400000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_7   (0x80UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos)  /*!< 0x00800000 */
#define DDRCTRL_INIT1_DRAM_RSTN_X1024_8   (0x100UL << DDRCTRL_INIT1_DRAM_RSTN_X1024_Pos) /*!< 0x01000000 */

/****************  Bit definition for DDRCTRL_INIT2 register  *****************/
#define DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_Pos  (0U)
#define DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_Msk  (0xFUL << DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_Pos)   /*!< 0x0000000F */
#define DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1      DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_Msk             /*!< Time to wait after the first CKE high, tINIT2. Present only in designs configured to support LPDDR2/LPDDR3. */
#define DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_0    (0x1UL << DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_Pos)   /*!< 0x00000001 */
#define DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_1    (0x2UL << DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_Pos)   /*!< 0x00000002 */
#define DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_2    (0x4UL << DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_Pos)   /*!< 0x00000004 */
#define DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_3    (0x8UL << DDRCTRL_INIT2_MIN_STABLE_CLOCK_X1_Pos)   /*!< 0x00000008 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos (8U)
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Msk (0xFFUL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos) /*!< 0x0000FF00 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32     DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Msk            /*!< Idle time after the reset command, tINIT4. Present only in designs configured to support LPDDR2. */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_0   (0x1UL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos)  /*!< 0x00000100 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_1   (0x2UL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos)  /*!< 0x00000200 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_2   (0x4UL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos)  /*!< 0x00000400 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_3   (0x8UL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos)  /*!< 0x00000800 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_4   (0x10UL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos) /*!< 0x00001000 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_5   (0x20UL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos) /*!< 0x00002000 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_6   (0x40UL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos) /*!< 0x00004000 */
#define DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_7   (0x80UL << DDRCTRL_INIT2_IDLE_AFTER_RESET_X32_Pos) /*!< 0x00008000 */

