zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
/****************  Bit definition for DDRCTRL_ZQSTAT register  ****************/
#define DDRCTRL_ZQSTAT_ZQ_RESET_BUSY_Pos (0U)
#define DDRCTRL_ZQSTAT_ZQ_RESET_BUSY_Msk (0x1UL << DDRCTRL_ZQSTAT_ZQ_RESET_BUSY_Pos) /*!< 0x00000001 */
#define DDRCTRL_ZQSTAT_ZQ_RESET_BUSY     DDRCTRL_ZQSTAT_ZQ_RESET_BUSY_Msk           /*!< SoC core may initiate a ZQ Reset operation only if this signal is low. This signal goes high in the clock after the DDRCTRL accepts the ZQ Reset request. It goes low when the ZQ Reset command is issued to the SDRAM and the associated NOP period is over. It is recommended not to perform ZQ Reset commands when this signal is high. */

/***************  Bit definition for DDRCTRL_DFITMG0 register  ****************/
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Pos   (0U)
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Msk   (0x3FUL << DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Pos)   /*!< 0x0000003F */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT       DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Msk              /*!< Write latency */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_0     (0x1UL << DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Pos)    /*!< 0x00000001 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_1     (0x2UL << DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Pos)    /*!< 0x00000002 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_2     (0x4UL << DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Pos)    /*!< 0x00000004 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_3     (0x8UL << DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Pos)    /*!< 0x00000008 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_4     (0x10UL << DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Pos)   /*!< 0x00000010 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_5     (0x20UL << DDRCTRL_DFITMG0_DFI_TPHY_WRLAT_Pos)   /*!< 0x00000020 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Pos  (8U)
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Msk  (0x3FUL << DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Pos)  /*!< 0x00003F00 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA      DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Msk             /*!< Specifies the number of clock cycles between when dfi_wrdata_en is asserted to when the associated write data is driven on the dfi_wrdata signal. This corresponds to the DFI timing parameter tphy_wrdata. Refer to PHY specification for correct value. Note, max supported value is 8. */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_0    (0x1UL << DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Pos)   /*!< 0x00000100 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_1    (0x2UL << DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Pos)   /*!< 0x00000200 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_2    (0x4UL << DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Pos)   /*!< 0x00000400 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_3    (0x8UL << DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Pos)   /*!< 0x00000800 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_4    (0x10UL << DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Pos)  /*!< 0x00001000 */
#define DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_5    (0x20UL << DDRCTRL_DFITMG0_DFI_TPHY_WRDATA_Pos)  /*!< 0x00002000 */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos  (16U)
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Msk  (0x7FUL << DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos)  /*!< 0x007F0000 */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN      DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Msk             /*!< Time from the assertion of a read command on the DFI interface to the assertion of the dfi_rddata_en signal. */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_0    (0x1UL << DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos)   /*!< 0x00010000 */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_1    (0x2UL << DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos)   /*!< 0x00020000 */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_2    (0x4UL << DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos)   /*!< 0x00040000 */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_3    (0x8UL << DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos)   /*!< 0x00080000 */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_4    (0x10UL << DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos)  /*!< 0x00100000 */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_5    (0x20UL << DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos)  /*!< 0x00200000 */
#define DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_6    (0x40UL << DDRCTRL_DFITMG0_DFI_T_RDDATA_EN_Pos)  /*!< 0x00400000 */
#define DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Pos (24U)
#define DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Msk (0x1FUL << DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Pos) /*!< 0x1F000000 */
#define DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY     DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Msk            /*!< Specifies the number of DFI clock cycles after an assertion or de-assertion of the DFI control signals that the control signals at the PHY-DRAM interface reflect the assertion or de-assertion. If the DFI clock and the memory clock are not phase-aligned, this timing parameter should be rounded up to the next integer value. Note that if using RDIMM/LRDIMM, it is necessary to increment this parameter by RDIMM\qs/LRDIMM\qs extra cycle of latency in terms of DFI clock. */
#define DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_0   (0x1UL << DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Pos)  /*!< 0x01000000 */
#define DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_1   (0x2UL << DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Pos)  /*!< 0x02000000 */
#define DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_2   (0x4UL << DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Pos)  /*!< 0x04000000 */
#define DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_3   (0x8UL << DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Pos)  /*!< 0x08000000 */
#define DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_4   (0x10UL << DDRCTRL_DFITMG0_DFI_T_CTRL_DELAY_Pos) /*!< 0x10000000 */

/***************  Bit definition for DDRCTRL_DFITMG1 register  ****************/
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Pos  (0U)
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Msk  (0x1FUL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Pos)  /*!< 0x0000001F */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE      DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Msk             /*!< Specifies the number of DFI clock cycles from the de-assertion of the dfi_dram_clk_disable signal on the DFI until the first valid rising edge of the clock to the DRAM memory devices, at the PHY-DRAM boundary. If the DFI clock and the memory clock are not phase aligned, this timing parameter should be rounded up to the next integer value. */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_0    (0x1UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Pos)   /*!< 0x00000001 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_1    (0x2UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Pos)   /*!< 0x00000002 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_2    (0x4UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Pos)   /*!< 0x00000004 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_3    (0x8UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Pos)   /*!< 0x00000008 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_4    (0x10UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_ENABLE_Pos)  /*!< 0x00000010 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Pos (8U)
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Msk (0x1FUL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Pos) /*!< 0x00001F00 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE     DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Msk            /*!< Specifies the number of DFI clock cycles from the assertion of the dfi_dram_clk_disable signal on the DFI until the clock to the DRAM memory devices, at the PHY-DRAM boundary, maintains a low value. If the DFI clock and the memory clock are not phase aligned, this timing parameter should be rounded up to the next integer value. */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_0   (0x1UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Pos)  /*!< 0x00000100 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_1   (0x2UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Pos)  /*!< 0x00000200 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_2   (0x4UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Pos)  /*!< 0x00000400 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_3   (0x8UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Pos)  /*!< 0x00000800 */
#define DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_4   (0x10UL << DDRCTRL_DFITMG1_DFI_T_DRAM_CLK_DISABLE_Pos) /*!< 0x00001000 */
#define DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Pos     (16U)
#define DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Msk     (0x1FUL << DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Pos)     /*!< 0x001F0000 */
#define DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY         DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Msk                /*!< Specifies the number of DFI clock cycles between when the dfi_wrdata_en */
#define DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_0       (0x1UL << DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Pos)      /*!< 0x00010000 */
#define DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_1       (0x2UL << DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Pos)      /*!< 0x00020000 */
#define DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_2       (0x4UL << DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Pos)      /*!< 0x00040000 */
#define DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_3       (0x8UL << DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Pos)      /*!< 0x00080000 */
#define DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_4       (0x10UL << DDRCTRL_DFITMG1_DFI_T_WRDATA_DELAY_Pos)     /*!< 0x00100000 */

