zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
/**************  Bit definition for RCC_MP_APB4ENSETR register  ***************/
#define RCC_MP_APB4ENSETR_DCMIPPEN_Pos             (1U)
#define RCC_MP_APB4ENSETR_DCMIPPEN_Msk             (0x1UL << RCC_MP_APB4ENSETR_DCMIPPEN_Pos)            /*!< 0x00000002 */
#define RCC_MP_APB4ENSETR_DCMIPPEN                 RCC_MP_APB4ENSETR_DCMIPPEN_Msk                      /*!< DCMIPP peripheral clocks enable If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB4ENSETR_DDRPERFMEN_Pos           (8U)
#define RCC_MP_APB4ENSETR_DDRPERFMEN_Msk           (0x1UL << RCC_MP_APB4ENSETR_DDRPERFMEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_APB4ENSETR_DDRPERFMEN               RCC_MP_APB4ENSETR_DDRPERFMEN_Msk                    /*!< DDRPERFM APB clock enable Set by software. */
#define RCC_MP_APB4ENSETR_IWDG2APBEN_Pos           (15U)
#define RCC_MP_APB4ENSETR_IWDG2APBEN_Msk           (0x1UL << RCC_MP_APB4ENSETR_IWDG2APBEN_Pos)          /*!< 0x00008000 */
#define RCC_MP_APB4ENSETR_IWDG2APBEN               RCC_MP_APB4ENSETR_IWDG2APBEN_Msk                    /*!< IWDG2 APB clock enable Set by software. */
#define RCC_MP_APB4ENSETR_USBPHYEN_Pos             (16U)
#define RCC_MP_APB4ENSETR_USBPHYEN_Msk             (0x1UL << RCC_MP_APB4ENSETR_USBPHYEN_Pos)            /*!< 0x00010000 */
#define RCC_MP_APB4ENSETR_USBPHYEN                 RCC_MP_APB4ENSETR_USBPHYEN_Msk                      /*!< USBPHYC peripheral clocks enable If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB4ENSETR_STGENROEN_Pos            (20U)
#define RCC_MP_APB4ENSETR_STGENROEN_Msk            (0x1UL << RCC_MP_APB4ENSETR_STGENROEN_Pos)           /*!< 0x00100000 */
#define RCC_MP_APB4ENSETR_STGENROEN                RCC_MP_APB4ENSETR_STGENROEN_Msk                     /*!< STGEN read-only interface peripheral clocks enable Set by software. The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register. */

/**************  Bit definition for RCC_MP_APB4ENCLRR register  ***************/
#define RCC_MP_APB4ENCLRR_DCMIPPEN_Pos             (1U)
#define RCC_MP_APB4ENCLRR_DCMIPPEN_Msk             (0x1UL << RCC_MP_APB4ENCLRR_DCMIPPEN_Pos)            /*!< 0x00000002 */
#define RCC_MP_APB4ENCLRR_DCMIPPEN                 RCC_MP_APB4ENCLRR_DCMIPPEN_Msk                      /*!< DCMIPP peripheral clocks enable If DCMIPP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB4ENCLRR_DDRPERFMEN_Pos           (8U)
#define RCC_MP_APB4ENCLRR_DDRPERFMEN_Msk           (0x1UL << RCC_MP_APB4ENCLRR_DDRPERFMEN_Pos)          /*!< 0x00000100 */
#define RCC_MP_APB4ENCLRR_DDRPERFMEN               RCC_MP_APB4ENCLRR_DDRPERFMEN_Msk                    /*!< DDRPERFM APB clock enable Cleared by software. */
#define RCC_MP_APB4ENCLRR_IWDG2APBEN_Pos           (15U)
#define RCC_MP_APB4ENCLRR_IWDG2APBEN_Msk           (0x1UL << RCC_MP_APB4ENCLRR_IWDG2APBEN_Pos)          /*!< 0x00008000 */
#define RCC_MP_APB4ENCLRR_IWDG2APBEN               RCC_MP_APB4ENCLRR_IWDG2APBEN_Msk                    /*!< IWDG2 APB clock enable Cleared by software. */
#define RCC_MP_APB4ENCLRR_USBPHYEN_Pos             (16U)
#define RCC_MP_APB4ENCLRR_USBPHYEN_Msk             (0x1UL << RCC_MP_APB4ENCLRR_USBPHYEN_Pos)            /*!< 0x00010000 */
#define RCC_MP_APB4ENCLRR_USBPHYEN                 RCC_MP_APB4ENCLRR_USBPHYEN_Msk                      /*!< USBPHYC peripheral clocks enable If USB PHY is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB4ENCLRR_STGENROEN_Pos            (20U)
#define RCC_MP_APB4ENCLRR_STGENROEN_Msk            (0x1UL << RCC_MP_APB4ENCLRR_STGENROEN_Pos)           /*!< 0x00100000 */
#define RCC_MP_APB4ENCLRR_STGENROEN                RCC_MP_APB4ENCLRR_STGENROEN_Msk                     /*!< STGEN read-only interface peripheral clocks enable Cleared by software. The peripheral clocks of the STGEN read-only interface are the pclk4, and the kernel clock as selected by the RCC_STGENCKSELR register. */

/*************  Bit definition for RCC_MP_S_APB4ENSETR register  **************/
#define RCC_MP_S_APB4ENSETR_LTDCEN_Pos             (0U)
#define RCC_MP_S_APB4ENSETR_LTDCEN_Msk             (0x1UL << RCC_MP_S_APB4ENSETR_LTDCEN_Pos)            /*!< 0x00000001 */
#define RCC_MP_S_APB4ENSETR_LTDCEN                 RCC_MP_S_APB4ENSETR_LTDCEN_Msk                      /*!< LTDC peripheral clocks enable Set by (secure) software. */

/*************  Bit definition for RCC_MP_S_APB4ENCLRR register  **************/
#define RCC_MP_S_APB4ENCLRR_LTDCEN_Pos             (0U)
#define RCC_MP_S_APB4ENCLRR_LTDCEN_Msk             (0x1UL << RCC_MP_S_APB4ENCLRR_LTDCEN_Pos)            /*!< 0x00000001 */
#define RCC_MP_S_APB4ENCLRR_LTDCEN                 RCC_MP_S_APB4ENCLRR_LTDCEN_Msk                      /*!< LTDC peripheral clocks enable Cleared by (secure) software. */

/*************  Bit definition for RCC_MP_NS_APB4ENSETR register  *************/
#define RCC_MP_NS_APB4ENSETR_LTDCEN_Pos            (0U)
#define RCC_MP_NS_APB4ENSETR_LTDCEN_Msk            (0x1UL << RCC_MP_NS_APB4ENSETR_LTDCEN_Pos)           /*!< 0x00000001 */
#define RCC_MP_NS_APB4ENSETR_LTDCEN                RCC_MP_NS_APB4ENSETR_LTDCEN_Msk                     /*!< LTDC peripheral clocks enable Set by software. */

/*************  Bit definition for RCC_MP_NS_APB4ENCLRR register  *************/
#define RCC_MP_NS_APB4ENCLRR_LTDCEN_Pos            (0U)
#define RCC_MP_NS_APB4ENCLRR_LTDCEN_Msk            (0x1UL << RCC_MP_NS_APB4ENCLRR_LTDCEN_Pos)           /*!< 0x00000001 */
#define RCC_MP_NS_APB4ENCLRR_LTDCEN                RCC_MP_NS_APB4ENCLRR_LTDCEN_Msk                     /*!< LTDC peripheral clocks enable Cleared by software. */

/**************  Bit definition for RCC_MP_APB5ENSETR register  ***************/
#define RCC_MP_APB5ENSETR_RTCAPBEN_Pos             (8U)
#define RCC_MP_APB5ENSETR_RTCAPBEN_Msk             (0x1UL << RCC_MP_APB5ENSETR_RTCAPBEN_Pos)            /*!< 0x00000100 */
#define RCC_MP_APB5ENSETR_RTCAPBEN                 RCC_MP_APB5ENSETR_RTCAPBEN_Msk                      /*!< RTC APB clock enable If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB5ENSETR_TZCEN_Pos                (11U)
#define RCC_MP_APB5ENSETR_TZCEN_Msk                (0x1UL << RCC_MP_APB5ENSETR_TZCEN_Pos)               /*!< 0x00000800 */
#define RCC_MP_APB5ENSETR_TZCEN                    RCC_MP_APB5ENSETR_TZCEN_Msk                         /*!< TZC clocks enable Set by (secure) software. See for details. */
#define RCC_MP_APB5ENSETR_ETZPCEN_Pos              (13U)
#define RCC_MP_APB5ENSETR_ETZPCEN_Msk              (0x1UL << RCC_MP_APB5ENSETR_ETZPCEN_Pos)             /*!< 0x00002000 */
#define RCC_MP_APB5ENSETR_ETZPCEN                  RCC_MP_APB5ENSETR_ETZPCEN_Msk                       /*!< ETZPC peripheral clocks enable A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_MP_APB5ENSETR_IWDG1APBEN_Pos           (15U)
#define RCC_MP_APB5ENSETR_IWDG1APBEN_Msk           (0x1UL << RCC_MP_APB5ENSETR_IWDG1APBEN_Pos)          /*!< 0x00008000 */
#define RCC_MP_APB5ENSETR_IWDG1APBEN               RCC_MP_APB5ENSETR_IWDG1APBEN_Msk                    /*!< IWDG1 APB clock enable If IWDG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB5ENSETR_BSECEN_Pos               (16U)
#define RCC_MP_APB5ENSETR_BSECEN_Msk               (0x1UL << RCC_MP_APB5ENSETR_BSECEN_Pos)              /*!< 0x00010000 */
#define RCC_MP_APB5ENSETR_BSECEN                   RCC_MP_APB5ENSETR_BSECEN_Msk                        /*!< BSEC peripheral clocks enable A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_MP_APB5ENSETR_STGENCEN_Pos             (20U)
#define RCC_MP_APB5ENSETR_STGENCEN_Msk             (0x1UL << RCC_MP_APB5ENSETR_STGENCEN_Pos)            /*!< 0x00100000 */
#define RCC_MP_APB5ENSETR_STGENCEN                 RCC_MP_APB5ENSETR_STGENCEN_Msk                      /*!< STGEN controller part, peripheral clocks enable If STGENC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. The peripheral clocks of the STGEN controller part are the pclk5, and the kernel clock as selected by the RCC_STGENCKSELR register. */

/**************  Bit definition for RCC_MP_APB5ENCLRR register  ***************/
#define RCC_MP_APB5ENCLRR_RTCAPBEN_Pos             (8U)
#define RCC_MP_APB5ENCLRR_RTCAPBEN_Msk             (0x1UL << RCC_MP_APB5ENCLRR_RTCAPBEN_Pos)            /*!< 0x00000100 */
#define RCC_MP_APB5ENCLRR_RTCAPBEN                 RCC_MP_APB5ENCLRR_RTCAPBEN_Msk                      /*!< RTC APB clock enable If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB5ENCLRR_TZCEN_Pos                (11U)
#define RCC_MP_APB5ENCLRR_TZCEN_Msk                (0x1UL << RCC_MP_APB5ENCLRR_TZCEN_Pos)               /*!< 0x00000800 */
#define RCC_MP_APB5ENCLRR_TZCEN                    RCC_MP_APB5ENCLRR_TZCEN_Msk                         /*!< TZC clocks enable Cleared by (secure) software. See for details. */
#define RCC_MP_APB5ENCLRR_ETZPCEN_Pos              (13U)
#define RCC_MP_APB5ENCLRR_ETZPCEN_Msk              (0x1UL << RCC_MP_APB5ENCLRR_ETZPCEN_Pos)             /*!< 0x00002000 */
#define RCC_MP_APB5ENCLRR_ETZPCEN                  RCC_MP_APB5ENCLRR_ETZPCEN_Msk                       /*!< ETZPC peripheral clocks enable A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_MP_APB5ENCLRR_IWDG1APBEN_Pos           (15U)
#define RCC_MP_APB5ENCLRR_IWDG1APBEN_Msk           (0x1UL << RCC_MP_APB5ENCLRR_IWDG1APBEN_Pos)          /*!< 0x00008000 */
#define RCC_MP_APB5ENCLRR_IWDG1APBEN               RCC_MP_APB5ENCLRR_IWDG1APBEN_Msk                    /*!< IWDG1 APB clock enable If IWDG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB5ENCLRR_BSECEN_Pos               (16U)
#define RCC_MP_APB5ENCLRR_BSECEN_Msk               (0x1UL << RCC_MP_APB5ENCLRR_BSECEN_Pos)              /*!< 0x00010000 */
#define RCC_MP_APB5ENCLRR_BSECEN                   RCC_MP_APB5ENCLRR_BSECEN_Msk                        /*!< BSEC peripheral clocks enable A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_MP_APB5ENCLRR_STGENCEN_Pos             (20U)
#define RCC_MP_APB5ENCLRR_STGENCEN_Msk             (0x1UL << RCC_MP_APB5ENCLRR_STGENCEN_Pos)            /*!< 0x00100000 */
#define RCC_MP_APB5ENCLRR_STGENCEN                 RCC_MP_APB5ENCLRR_STGENCEN_Msk                      /*!< STGEN controller part, peripheral clocks enable If STGENC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. The peripheral clocks of the STGEN controller part are the pclk5, and the kernel clock as selected by the RCC_STGENCKSELR register. */

