zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
/*************  Bit definition for RCC_MP_APB5LPENSETR register  **************/
#define RCC_MP_APB5LPENSETR_RTCAPBLPEN_Pos         (8U)
#define RCC_MP_APB5LPENSETR_RTCAPBLPEN_Msk         (0x1UL << RCC_MP_APB5LPENSETR_RTCAPBLPEN_Pos)        /*!< 0x00000100 */
#define RCC_MP_APB5LPENSETR_RTCAPBLPEN             RCC_MP_APB5LPENSETR_RTCAPBLPEN_Msk                  /*!< RTC APB clock enable during CSleep mode If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB5LPENSETR_TZCLPEN_Pos            (11U)
#define RCC_MP_APB5LPENSETR_TZCLPEN_Msk            (0x1UL << RCC_MP_APB5LPENSETR_TZCLPEN_Pos)           /*!< 0x00000800 */
#define RCC_MP_APB5LPENSETR_TZCLPEN                RCC_MP_APB5LPENSETR_TZCLPEN_Msk                     /*!< TZC clocks enable during CSleep mode Set by (secure) software. See for details. */
#define RCC_MP_APB5LPENSETR_ETZPCLPEN_Pos          (13U)
#define RCC_MP_APB5LPENSETR_ETZPCLPEN_Msk          (0x1UL << RCC_MP_APB5LPENSETR_ETZPCLPEN_Pos)         /*!< 0x00002000 */
#define RCC_MP_APB5LPENSETR_ETZPCLPEN              RCC_MP_APB5LPENSETR_ETZPCLPEN_Msk                   /*!< ETZPC peripheral clocks enable during CSleep mode A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_MP_APB5LPENSETR_IWDG1APBLPEN_Pos       (15U)
#define RCC_MP_APB5LPENSETR_IWDG1APBLPEN_Msk       (0x1UL << RCC_MP_APB5LPENSETR_IWDG1APBLPEN_Pos)      /*!< 0x00008000 */
#define RCC_MP_APB5LPENSETR_IWDG1APBLPEN           RCC_MP_APB5LPENSETR_IWDG1APBLPEN_Msk                /*!< IWDG1 APB clock enable during CSleep mode If IWDG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB5LPENSETR_BSECLPEN_Pos           (16U)
#define RCC_MP_APB5LPENSETR_BSECLPEN_Msk           (0x1UL << RCC_MP_APB5LPENSETR_BSECLPEN_Pos)          /*!< 0x00010000 */
#define RCC_MP_APB5LPENSETR_BSECLPEN               RCC_MP_APB5LPENSETR_BSECLPEN_Msk                    /*!< BSEC peripheral clocks enable during CSleep mode A write access to this register field must be secure. A read access may be secure or non-secure. Set by (secure) software. */
#define RCC_MP_APB5LPENSETR_STGENCLPEN_Pos         (20U)
#define RCC_MP_APB5LPENSETR_STGENCLPEN_Msk         (0x1UL << RCC_MP_APB5LPENSETR_STGENCLPEN_Pos)        /*!< 0x00100000 */
#define RCC_MP_APB5LPENSETR_STGENCLPEN             RCC_MP_APB5LPENSETR_STGENCLPEN_Msk                  /*!< STGEN controller part, peripheral clocks enable during CSleep mode If STGENC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. The peripheral clocks of the STGEN controller part are the pclk5, and the kernel clock as selected by the RCC_STGENCKSELR register. */
#define RCC_MP_APB5LPENSETR_STGENCSTPEN_Pos        (21U)
#define RCC_MP_APB5LPENSETR_STGENCSTPEN_Msk        (0x1UL << RCC_MP_APB5LPENSETR_STGENCSTPEN_Pos)       /*!< 0x00200000 */
#define RCC_MP_APB5LPENSETR_STGENCSTPEN            RCC_MP_APB5LPENSETR_STGENCSTPEN_Msk                 /*!< STGEN controller part, peripheral clocks enable during CStop mode If STGENC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. The peripheral clocks of the STGEN controller part are the pclk5, and the kernel clock as selected by the RCC_STGENCKSELR register. */

/*************  Bit definition for RCC_MP_APB5LPENCLRR register  **************/
#define RCC_MP_APB5LPENCLRR_RTCAPBLPEN_Pos         (8U)
#define RCC_MP_APB5LPENCLRR_RTCAPBLPEN_Msk         (0x1UL << RCC_MP_APB5LPENCLRR_RTCAPBLPEN_Pos)        /*!< 0x00000100 */
#define RCC_MP_APB5LPENCLRR_RTCAPBLPEN             RCC_MP_APB5LPENCLRR_RTCAPBLPEN_Msk                  /*!< RTC APB clock enable during CSleep mode If at least one function of the RTC is configured as secure via the RTC_SECCFGR register (i.e. if the input signal rtc_sec driven by RTC is asserted), a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB5LPENCLRR_TZCLPEN_Pos            (11U)
#define RCC_MP_APB5LPENCLRR_TZCLPEN_Msk            (0x1UL << RCC_MP_APB5LPENCLRR_TZCLPEN_Pos)           /*!< 0x00000800 */
#define RCC_MP_APB5LPENCLRR_TZCLPEN                RCC_MP_APB5LPENCLRR_TZCLPEN_Msk                     /*!< TZC clocks enable during CSleep mode Cleared by (secure) software. See for details. */
#define RCC_MP_APB5LPENCLRR_ETZPCLPEN_Pos          (13U)
#define RCC_MP_APB5LPENCLRR_ETZPCLPEN_Msk          (0x1UL << RCC_MP_APB5LPENCLRR_ETZPCLPEN_Pos)         /*!< 0x00002000 */
#define RCC_MP_APB5LPENCLRR_ETZPCLPEN              RCC_MP_APB5LPENCLRR_ETZPCLPEN_Msk                   /*!< ETZPC peripheral clocks enable during CSleep mode A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_MP_APB5LPENCLRR_IWDG1APBLPEN_Pos       (15U)
#define RCC_MP_APB5LPENCLRR_IWDG1APBLPEN_Msk       (0x1UL << RCC_MP_APB5LPENCLRR_IWDG1APBLPEN_Pos)      /*!< 0x00008000 */
#define RCC_MP_APB5LPENCLRR_IWDG1APBLPEN           RCC_MP_APB5LPENCLRR_IWDG1APBLPEN_Msk                /*!< IWDG1 APB clock enable during CSleep mode If IWDG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB5LPENCLRR_BSECLPEN_Pos           (16U)
#define RCC_MP_APB5LPENCLRR_BSECLPEN_Msk           (0x1UL << RCC_MP_APB5LPENCLRR_BSECLPEN_Pos)          /*!< 0x00010000 */
#define RCC_MP_APB5LPENCLRR_BSECLPEN               RCC_MP_APB5LPENCLRR_BSECLPEN_Msk                    /*!< BSEC peripheral clocks enable during CSleep mode A write access to this register field must be secure. A read access may be secure or non-secure. Cleared by (secure) software. */
#define RCC_MP_APB5LPENCLRR_STGENCLPEN_Pos         (20U)
#define RCC_MP_APB5LPENCLRR_STGENCLPEN_Msk         (0x1UL << RCC_MP_APB5LPENCLRR_STGENCLPEN_Pos)        /*!< 0x00100000 */
#define RCC_MP_APB5LPENCLRR_STGENCLPEN             RCC_MP_APB5LPENCLRR_STGENCLPEN_Msk                  /*!< STGEN controller part, peripheral clocks enable during CSleep mode If STGENC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. The peripheral clocks of the STGEN controller part are the pclk5, and the kernel clock as selected by the RCC_STGENCKSELR register. */
#define RCC_MP_APB5LPENCLRR_STGENCSTPEN_Pos        (21U)
#define RCC_MP_APB5LPENCLRR_STGENCSTPEN_Msk        (0x1UL << RCC_MP_APB5LPENCLRR_STGENCSTPEN_Pos)       /*!< 0x00200000 */
#define RCC_MP_APB5LPENCLRR_STGENCSTPEN            RCC_MP_APB5LPENCLRR_STGENCSTPEN_Msk                 /*!< STGEN controller part, peripheral clocks enable during CStop mode If STGENC is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. The peripheral clocks of the STGEN controller part are the pclk5, and the kernel clock as selected by the RCC_STGENCKSELR register. */

/*************  Bit definition for RCC_MP_APB6LPENSETR register  **************/
#define RCC_MP_APB6LPENSETR_USART1LPEN_Pos         (0U)
#define RCC_MP_APB6LPENSETR_USART1LPEN_Msk         (0x1UL << RCC_MP_APB6LPENSETR_USART1LPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_APB6LPENSETR_USART1LPEN             RCC_MP_APB6LPENSETR_USART1LPEN_Msk                  /*!< USART1 peripherals clocks during CSleep mode If USART1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_USART2LPEN_Pos         (1U)
#define RCC_MP_APB6LPENSETR_USART2LPEN_Msk         (0x1UL << RCC_MP_APB6LPENSETR_USART2LPEN_Pos)        /*!< 0x00000002 */
#define RCC_MP_APB6LPENSETR_USART2LPEN             RCC_MP_APB6LPENSETR_USART2LPEN_Msk                  /*!< USART2 peripherals clocks during CSleep mode If USART2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_SPI4LPEN_Pos           (2U)
#define RCC_MP_APB6LPENSETR_SPI4LPEN_Msk           (0x1UL << RCC_MP_APB6LPENSETR_SPI4LPEN_Pos)          /*!< 0x00000004 */
#define RCC_MP_APB6LPENSETR_SPI4LPEN               RCC_MP_APB6LPENSETR_SPI4LPEN_Msk                    /*!< SPI4 peripherals clocks during CSleep mode If SPI4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_SPI5LPEN_Pos           (3U)
#define RCC_MP_APB6LPENSETR_SPI5LPEN_Msk           (0x1UL << RCC_MP_APB6LPENSETR_SPI5LPEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_APB6LPENSETR_SPI5LPEN               RCC_MP_APB6LPENSETR_SPI5LPEN_Msk                    /*!< SPI5 peripherals clocks during CSleep mode If SPI5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_I2C3LPEN_Pos           (4U)
#define RCC_MP_APB6LPENSETR_I2C3LPEN_Msk           (0x1UL << RCC_MP_APB6LPENSETR_I2C3LPEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_APB6LPENSETR_I2C3LPEN               RCC_MP_APB6LPENSETR_I2C3LPEN_Msk                    /*!< I2C3 peripherals clocks during CSleep mode If I2C3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_I2C4LPEN_Pos           (5U)
#define RCC_MP_APB6LPENSETR_I2C4LPEN_Msk           (0x1UL << RCC_MP_APB6LPENSETR_I2C4LPEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_APB6LPENSETR_I2C4LPEN               RCC_MP_APB6LPENSETR_I2C4LPEN_Msk                    /*!< I2C4 peripherals clocks during CSleep mode If I2C4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_I2C5LPEN_Pos           (6U)
#define RCC_MP_APB6LPENSETR_I2C5LPEN_Msk           (0x1UL << RCC_MP_APB6LPENSETR_I2C5LPEN_Pos)          /*!< 0x00000040 */
#define RCC_MP_APB6LPENSETR_I2C5LPEN               RCC_MP_APB6LPENSETR_I2C5LPEN_Msk                    /*!< I2C5 peripherals clocks during CSleep mode If I2C5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_TIM12LPEN_Pos          (7U)
#define RCC_MP_APB6LPENSETR_TIM12LPEN_Msk          (0x1UL << RCC_MP_APB6LPENSETR_TIM12LPEN_Pos)         /*!< 0x00000080 */
#define RCC_MP_APB6LPENSETR_TIM12LPEN              RCC_MP_APB6LPENSETR_TIM12LPEN_Msk                   /*!< TIM12 peripherals clocks during CSleep mode If TIM12 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_TIM13LPEN_Pos          (8U)
#define RCC_MP_APB6LPENSETR_TIM13LPEN_Msk          (0x1UL << RCC_MP_APB6LPENSETR_TIM13LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_APB6LPENSETR_TIM13LPEN              RCC_MP_APB6LPENSETR_TIM13LPEN_Msk                   /*!< TIM13 peripherals clocks during CSleep mode If TIM13 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_TIM14LPEN_Pos          (9U)
#define RCC_MP_APB6LPENSETR_TIM14LPEN_Msk          (0x1UL << RCC_MP_APB6LPENSETR_TIM14LPEN_Pos)         /*!< 0x00000200 */
#define RCC_MP_APB6LPENSETR_TIM14LPEN              RCC_MP_APB6LPENSETR_TIM14LPEN_Msk                   /*!< TIM14 peripherals clocks during CSleep mode If TIM14 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_TIM15LPEN_Pos          (10U)
#define RCC_MP_APB6LPENSETR_TIM15LPEN_Msk          (0x1UL << RCC_MP_APB6LPENSETR_TIM15LPEN_Pos)         /*!< 0x00000400 */
#define RCC_MP_APB6LPENSETR_TIM15LPEN              RCC_MP_APB6LPENSETR_TIM15LPEN_Msk                   /*!< TIM15 peripherals clocks during CSleep mode If TIM15 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_TIM16LPEN_Pos          (11U)
#define RCC_MP_APB6LPENSETR_TIM16LPEN_Msk          (0x1UL << RCC_MP_APB6LPENSETR_TIM16LPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_APB6LPENSETR_TIM16LPEN              RCC_MP_APB6LPENSETR_TIM16LPEN_Msk                   /*!< TIM16 peripherals clocks during CSleep mode If TIM16 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_APB6LPENSETR_TIM17LPEN_Pos          (12U)
#define RCC_MP_APB6LPENSETR_TIM17LPEN_Msk          (0x1UL << RCC_MP_APB6LPENSETR_TIM17LPEN_Pos)         /*!< 0x00001000 */
#define RCC_MP_APB6LPENSETR_TIM17LPEN              RCC_MP_APB6LPENSETR_TIM17LPEN_Msk                   /*!< TIM17 peripherals clocks during CSleep mode If TIM17 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

/*************  Bit definition for RCC_MP_APB6LPENCLRR register  **************/
#define RCC_MP_APB6LPENCLRR_USART1LPEN_Pos         (0U)
#define RCC_MP_APB6LPENCLRR_USART1LPEN_Msk         (0x1UL << RCC_MP_APB6LPENCLRR_USART1LPEN_Pos)        /*!< 0x00000001 */
#define RCC_MP_APB6LPENCLRR_USART1LPEN             RCC_MP_APB6LPENCLRR_USART1LPEN_Msk                  /*!< USART1 peripherals clocks during CSleep mode If USART1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_USART2LPEN_Pos         (1U)
#define RCC_MP_APB6LPENCLRR_USART2LPEN_Msk         (0x1UL << RCC_MP_APB6LPENCLRR_USART2LPEN_Pos)        /*!< 0x00000002 */
#define RCC_MP_APB6LPENCLRR_USART2LPEN             RCC_MP_APB6LPENCLRR_USART2LPEN_Msk                  /*!< USART2 peripherals clocks during CSleep mode If USART2 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_SPI4LPEN_Pos           (2U)
#define RCC_MP_APB6LPENCLRR_SPI4LPEN_Msk           (0x1UL << RCC_MP_APB6LPENCLRR_SPI4LPEN_Pos)          /*!< 0x00000004 */
#define RCC_MP_APB6LPENCLRR_SPI4LPEN               RCC_MP_APB6LPENCLRR_SPI4LPEN_Msk                    /*!< SPI4 peripherals clocks during CSleep mode If SPI4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_SPI5LPEN_Pos           (3U)
#define RCC_MP_APB6LPENCLRR_SPI5LPEN_Msk           (0x1UL << RCC_MP_APB6LPENCLRR_SPI5LPEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_APB6LPENCLRR_SPI5LPEN               RCC_MP_APB6LPENCLRR_SPI5LPEN_Msk                    /*!< SPI5 peripherals clocks during CSleep mode If SPI5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_I2C3LPEN_Pos           (4U)
#define RCC_MP_APB6LPENCLRR_I2C3LPEN_Msk           (0x1UL << RCC_MP_APB6LPENCLRR_I2C3LPEN_Pos)          /*!< 0x00000010 */
#define RCC_MP_APB6LPENCLRR_I2C3LPEN               RCC_MP_APB6LPENCLRR_I2C3LPEN_Msk                    /*!< I2C3 peripherals clocks during CSleep mode If I2C3 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_I2C4LPEN_Pos           (5U)
#define RCC_MP_APB6LPENCLRR_I2C4LPEN_Msk           (0x1UL << RCC_MP_APB6LPENCLRR_I2C4LPEN_Pos)          /*!< 0x00000020 */
#define RCC_MP_APB6LPENCLRR_I2C4LPEN               RCC_MP_APB6LPENCLRR_I2C4LPEN_Msk                    /*!< I2C4 peripherals clocks during CSleep mode If I2C4 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_I2C5LPEN_Pos           (6U)
#define RCC_MP_APB6LPENCLRR_I2C5LPEN_Msk           (0x1UL << RCC_MP_APB6LPENCLRR_I2C5LPEN_Pos)          /*!< 0x00000040 */
#define RCC_MP_APB6LPENCLRR_I2C5LPEN               RCC_MP_APB6LPENCLRR_I2C5LPEN_Msk                    /*!< I2C5 peripherals clocks during CSleep mode If I2C5 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_TIM12LPEN_Pos          (7U)
#define RCC_MP_APB6LPENCLRR_TIM12LPEN_Msk          (0x1UL << RCC_MP_APB6LPENCLRR_TIM12LPEN_Pos)         /*!< 0x00000080 */
#define RCC_MP_APB6LPENCLRR_TIM12LPEN              RCC_MP_APB6LPENCLRR_TIM12LPEN_Msk                   /*!< TIM12 peripherals clocks during CSleep mode If TIM12 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_TIM13LPEN_Pos          (8U)
#define RCC_MP_APB6LPENCLRR_TIM13LPEN_Msk          (0x1UL << RCC_MP_APB6LPENCLRR_TIM13LPEN_Pos)         /*!< 0x00000100 */
#define RCC_MP_APB6LPENCLRR_TIM13LPEN              RCC_MP_APB6LPENCLRR_TIM13LPEN_Msk                   /*!< TIM13 peripherals clocks during CSleep mode If TIM13 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_TIM14LPEN_Pos          (9U)
#define RCC_MP_APB6LPENCLRR_TIM14LPEN_Msk          (0x1UL << RCC_MP_APB6LPENCLRR_TIM14LPEN_Pos)         /*!< 0x00000200 */
#define RCC_MP_APB6LPENCLRR_TIM14LPEN              RCC_MP_APB6LPENCLRR_TIM14LPEN_Msk                   /*!< TIM14 peripherals clocks during CSleep mode If TIM14 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_TIM15LPEN_Pos          (10U)
#define RCC_MP_APB6LPENCLRR_TIM15LPEN_Msk          (0x1UL << RCC_MP_APB6LPENCLRR_TIM15LPEN_Pos)         /*!< 0x00000400 */
#define RCC_MP_APB6LPENCLRR_TIM15LPEN              RCC_MP_APB6LPENCLRR_TIM15LPEN_Msk                   /*!< TIM15 peripherals clocks during CSleep mode If TIM15 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_TIM16LPEN_Pos          (11U)
#define RCC_MP_APB6LPENCLRR_TIM16LPEN_Msk          (0x1UL << RCC_MP_APB6LPENCLRR_TIM16LPEN_Pos)         /*!< 0x00000800 */
#define RCC_MP_APB6LPENCLRR_TIM16LPEN              RCC_MP_APB6LPENCLRR_TIM16LPEN_Msk                   /*!< TIM16 peripherals clocks during CSleep mode If TIM16 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_APB6LPENCLRR_TIM17LPEN_Pos          (12U)
#define RCC_MP_APB6LPENCLRR_TIM17LPEN_Msk          (0x1UL << RCC_MP_APB6LPENCLRR_TIM17LPEN_Pos)         /*!< 0x00001000 */
#define RCC_MP_APB6LPENCLRR_TIM17LPEN              RCC_MP_APB6LPENCLRR_TIM17LPEN_Msk                   /*!< TIM17 peripherals clocks during CSleep mode If TIM17 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

