zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
/************  Bit definition for RCC_MP_S_AHB4LPENSETR register  *************/
#define RCC_MP_S_AHB4LPENSETR_GPIOALPEN_Pos        (0U)
#define RCC_MP_S_AHB4LPENSETR_GPIOALPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIOALPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_S_AHB4LPENSETR_GPIOALPEN            RCC_MP_S_AHB4LPENSETR_GPIOALPEN_Msk                 /*!< GPIOA peripheral clocks enable during CSleep mode Set by (secure) software. */
#define RCC_MP_S_AHB4LPENSETR_GPIOBLPEN_Pos        (1U)
#define RCC_MP_S_AHB4LPENSETR_GPIOBLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIOBLPEN_Pos)       /*!< 0x00000002 */
#define RCC_MP_S_AHB4LPENSETR_GPIOBLPEN            RCC_MP_S_AHB4LPENSETR_GPIOBLPEN_Msk                 /*!< GPIOB peripheral clocks enable during CSleep mode Set by (secure) software. */
#define RCC_MP_S_AHB4LPENSETR_GPIOCLPEN_Pos        (2U)
#define RCC_MP_S_AHB4LPENSETR_GPIOCLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIOCLPEN_Pos)       /*!< 0x00000004 */
#define RCC_MP_S_AHB4LPENSETR_GPIOCLPEN            RCC_MP_S_AHB4LPENSETR_GPIOCLPEN_Msk                 /*!< GPIOC peripheral clocks enable during CSleep mode Set by (secure) software. */
#define RCC_MP_S_AHB4LPENSETR_GPIODLPEN_Pos        (3U)
#define RCC_MP_S_AHB4LPENSETR_GPIODLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIODLPEN_Pos)       /*!< 0x00000008 */
#define RCC_MP_S_AHB4LPENSETR_GPIODLPEN            RCC_MP_S_AHB4LPENSETR_GPIODLPEN_Msk                 /*!< GPIOD peripheral clocks enable during CSleep mode Set by (secure) software. */
#define RCC_MP_S_AHB4LPENSETR_GPIOELPEN_Pos        (4U)
#define RCC_MP_S_AHB4LPENSETR_GPIOELPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIOELPEN_Pos)       /*!< 0x00000010 */
#define RCC_MP_S_AHB4LPENSETR_GPIOELPEN            RCC_MP_S_AHB4LPENSETR_GPIOELPEN_Msk                 /*!< GPIOE peripheral clocks enable during CSleep mode Set by (secure) software. */
#define RCC_MP_S_AHB4LPENSETR_GPIOFLPEN_Pos        (5U)
#define RCC_MP_S_AHB4LPENSETR_GPIOFLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIOFLPEN_Pos)       /*!< 0x00000020 */
#define RCC_MP_S_AHB4LPENSETR_GPIOFLPEN            RCC_MP_S_AHB4LPENSETR_GPIOFLPEN_Msk                 /*!< GPIOF peripheral clocks enable during CSleep mode Set by (secure) software. */
#define RCC_MP_S_AHB4LPENSETR_GPIOGLPEN_Pos        (6U)
#define RCC_MP_S_AHB4LPENSETR_GPIOGLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIOGLPEN_Pos)       /*!< 0x00000040 */
#define RCC_MP_S_AHB4LPENSETR_GPIOGLPEN            RCC_MP_S_AHB4LPENSETR_GPIOGLPEN_Msk                 /*!< GPIOG peripheral clocks enable during CSleep mode Set by (secure) software. */
#define RCC_MP_S_AHB4LPENSETR_GPIOHLPEN_Pos        (7U)
#define RCC_MP_S_AHB4LPENSETR_GPIOHLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIOHLPEN_Pos)       /*!< 0x00000080 */
#define RCC_MP_S_AHB4LPENSETR_GPIOHLPEN            RCC_MP_S_AHB4LPENSETR_GPIOHLPEN_Msk                 /*!< GPIOH peripheral clocks enable during CSleep mode Set by (secure) software. */
#define RCC_MP_S_AHB4LPENSETR_GPIOILPEN_Pos        (8U)
#define RCC_MP_S_AHB4LPENSETR_GPIOILPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENSETR_GPIOILPEN_Pos)       /*!< 0x00000100 */
#define RCC_MP_S_AHB4LPENSETR_GPIOILPEN            RCC_MP_S_AHB4LPENSETR_GPIOILPEN_Msk                 /*!< GPIOI peripheral clocks enable during CSleep mode Set by (secure) software. */

/************  Bit definition for RCC_MP_S_AHB4LPENCLRR register  *************/
#define RCC_MP_S_AHB4LPENCLRR_GPIOALPEN_Pos        (0U)
#define RCC_MP_S_AHB4LPENCLRR_GPIOALPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIOALPEN_Pos)       /*!< 0x00000001 */
#define RCC_MP_S_AHB4LPENCLRR_GPIOALPEN            RCC_MP_S_AHB4LPENCLRR_GPIOALPEN_Msk                 /*!< GPIOA peripheral clocks enable during CSleep mode Cleared by (secure) software. */
#define RCC_MP_S_AHB4LPENCLRR_GPIOBLPEN_Pos        (1U)
#define RCC_MP_S_AHB4LPENCLRR_GPIOBLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIOBLPEN_Pos)       /*!< 0x00000002 */
#define RCC_MP_S_AHB4LPENCLRR_GPIOBLPEN            RCC_MP_S_AHB4LPENCLRR_GPIOBLPEN_Msk                 /*!< GPIOB peripheral clocks enable during CSleep mode Cleared by (secure) software. */
#define RCC_MP_S_AHB4LPENCLRR_GPIOCLPEN_Pos        (2U)
#define RCC_MP_S_AHB4LPENCLRR_GPIOCLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIOCLPEN_Pos)       /*!< 0x00000004 */
#define RCC_MP_S_AHB4LPENCLRR_GPIOCLPEN            RCC_MP_S_AHB4LPENCLRR_GPIOCLPEN_Msk                 /*!< GPIOC peripheral clocks enable during CSleep mode Cleared by (secure) software. */
#define RCC_MP_S_AHB4LPENCLRR_GPIODLPEN_Pos        (3U)
#define RCC_MP_S_AHB4LPENCLRR_GPIODLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIODLPEN_Pos)       /*!< 0x00000008 */
#define RCC_MP_S_AHB4LPENCLRR_GPIODLPEN            RCC_MP_S_AHB4LPENCLRR_GPIODLPEN_Msk                 /*!< GPIOD peripheral clocks enable during CSleep mode Cleared by (secure) software. */
#define RCC_MP_S_AHB4LPENCLRR_GPIOELPEN_Pos        (4U)
#define RCC_MP_S_AHB4LPENCLRR_GPIOELPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIOELPEN_Pos)       /*!< 0x00000010 */
#define RCC_MP_S_AHB4LPENCLRR_GPIOELPEN            RCC_MP_S_AHB4LPENCLRR_GPIOELPEN_Msk                 /*!< GPIOE peripheral clocks enable during CSleep mode Cleared by (secure) software. */
#define RCC_MP_S_AHB4LPENCLRR_GPIOFLPEN_Pos        (5U)
#define RCC_MP_S_AHB4LPENCLRR_GPIOFLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIOFLPEN_Pos)       /*!< 0x00000020 */
#define RCC_MP_S_AHB4LPENCLRR_GPIOFLPEN            RCC_MP_S_AHB4LPENCLRR_GPIOFLPEN_Msk                 /*!< GPIOF peripheral clocks enable during CSleep mode Cleared by (secure) software. */
#define RCC_MP_S_AHB4LPENCLRR_GPIOGLPEN_Pos        (6U)
#define RCC_MP_S_AHB4LPENCLRR_GPIOGLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIOGLPEN_Pos)       /*!< 0x00000040 */
#define RCC_MP_S_AHB4LPENCLRR_GPIOGLPEN            RCC_MP_S_AHB4LPENCLRR_GPIOGLPEN_Msk                 /*!< GPIOG peripheral clocks enable during CSleep mode Cleared by (secure) software. */
#define RCC_MP_S_AHB4LPENCLRR_GPIOHLPEN_Pos        (7U)
#define RCC_MP_S_AHB4LPENCLRR_GPIOHLPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIOHLPEN_Pos)       /*!< 0x00000080 */
#define RCC_MP_S_AHB4LPENCLRR_GPIOHLPEN            RCC_MP_S_AHB4LPENCLRR_GPIOHLPEN_Msk                 /*!< GPIOH peripheral clocks enable during CSleep mode Cleared by (secure) software. */
#define RCC_MP_S_AHB4LPENCLRR_GPIOILPEN_Pos        (8U)
#define RCC_MP_S_AHB4LPENCLRR_GPIOILPEN_Msk        (0x1UL << RCC_MP_S_AHB4LPENCLRR_GPIOILPEN_Pos)       /*!< 0x00000100 */
#define RCC_MP_S_AHB4LPENCLRR_GPIOILPEN            RCC_MP_S_AHB4LPENCLRR_GPIOILPEN_Msk                 /*!< GPIOI peripheral clocks enable during CSleep mode Cleared by (secure) software. */

/************  Bit definition for RCC_MP_NS_AHB4LPENSETR register  ************/
#define RCC_MP_NS_AHB4LPENSETR_GPIOALPEN_Pos       (0U)
#define RCC_MP_NS_AHB4LPENSETR_GPIOALPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIOALPEN_Pos)      /*!< 0x00000001 */
#define RCC_MP_NS_AHB4LPENSETR_GPIOALPEN           RCC_MP_NS_AHB4LPENSETR_GPIOALPEN_Msk                /*!< GPIOA peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_NS_AHB4LPENSETR_GPIOBLPEN_Pos       (1U)
#define RCC_MP_NS_AHB4LPENSETR_GPIOBLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIOBLPEN_Pos)      /*!< 0x00000002 */
#define RCC_MP_NS_AHB4LPENSETR_GPIOBLPEN           RCC_MP_NS_AHB4LPENSETR_GPIOBLPEN_Msk                /*!< GPIOB peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_NS_AHB4LPENSETR_GPIOCLPEN_Pos       (2U)
#define RCC_MP_NS_AHB4LPENSETR_GPIOCLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIOCLPEN_Pos)      /*!< 0x00000004 */
#define RCC_MP_NS_AHB4LPENSETR_GPIOCLPEN           RCC_MP_NS_AHB4LPENSETR_GPIOCLPEN_Msk                /*!< GPIOC peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_NS_AHB4LPENSETR_GPIODLPEN_Pos       (3U)
#define RCC_MP_NS_AHB4LPENSETR_GPIODLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIODLPEN_Pos)      /*!< 0x00000008 */
#define RCC_MP_NS_AHB4LPENSETR_GPIODLPEN           RCC_MP_NS_AHB4LPENSETR_GPIODLPEN_Msk                /*!< GPIOD peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_NS_AHB4LPENSETR_GPIOELPEN_Pos       (4U)
#define RCC_MP_NS_AHB4LPENSETR_GPIOELPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIOELPEN_Pos)      /*!< 0x00000010 */
#define RCC_MP_NS_AHB4LPENSETR_GPIOELPEN           RCC_MP_NS_AHB4LPENSETR_GPIOELPEN_Msk                /*!< GPIOE peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_NS_AHB4LPENSETR_GPIOFLPEN_Pos       (5U)
#define RCC_MP_NS_AHB4LPENSETR_GPIOFLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIOFLPEN_Pos)      /*!< 0x00000020 */
#define RCC_MP_NS_AHB4LPENSETR_GPIOFLPEN           RCC_MP_NS_AHB4LPENSETR_GPIOFLPEN_Msk                /*!< GPIOF peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_NS_AHB4LPENSETR_GPIOGLPEN_Pos       (6U)
#define RCC_MP_NS_AHB4LPENSETR_GPIOGLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIOGLPEN_Pos)      /*!< 0x00000040 */
#define RCC_MP_NS_AHB4LPENSETR_GPIOGLPEN           RCC_MP_NS_AHB4LPENSETR_GPIOGLPEN_Msk                /*!< GPIOG peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_NS_AHB4LPENSETR_GPIOHLPEN_Pos       (7U)
#define RCC_MP_NS_AHB4LPENSETR_GPIOHLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIOHLPEN_Pos)      /*!< 0x00000080 */
#define RCC_MP_NS_AHB4LPENSETR_GPIOHLPEN           RCC_MP_NS_AHB4LPENSETR_GPIOHLPEN_Msk                /*!< GPIOH peripheral clocks enable during CSleep mode Set by software. */
#define RCC_MP_NS_AHB4LPENSETR_GPIOILPEN_Pos       (8U)
#define RCC_MP_NS_AHB4LPENSETR_GPIOILPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENSETR_GPIOILPEN_Pos)      /*!< 0x00000100 */
#define RCC_MP_NS_AHB4LPENSETR_GPIOILPEN           RCC_MP_NS_AHB4LPENSETR_GPIOILPEN_Msk                /*!< GPIOI peripheral clocks enable during CSleep mode Set by software. */

/************  Bit definition for RCC_MP_NS_AHB4LPENCLRR register  ************/
#define RCC_MP_NS_AHB4LPENCLRR_GPIOALPEN_Pos       (0U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOALPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIOALPEN_Pos)      /*!< 0x00000001 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOALPEN           RCC_MP_NS_AHB4LPENCLRR_GPIOALPEN_Msk                /*!< GPIOA peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOBLPEN_Pos       (1U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOBLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIOBLPEN_Pos)      /*!< 0x00000002 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOBLPEN           RCC_MP_NS_AHB4LPENCLRR_GPIOBLPEN_Msk                /*!< GPIOB peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOCLPEN_Pos       (2U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOCLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIOCLPEN_Pos)      /*!< 0x00000004 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOCLPEN           RCC_MP_NS_AHB4LPENCLRR_GPIOCLPEN_Msk                /*!< GPIOC peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_NS_AHB4LPENCLRR_GPIODLPEN_Pos       (3U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIODLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIODLPEN_Pos)      /*!< 0x00000008 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIODLPEN           RCC_MP_NS_AHB4LPENCLRR_GPIODLPEN_Msk                /*!< GPIOD peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOELPEN_Pos       (4U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOELPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIOELPEN_Pos)      /*!< 0x00000010 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOELPEN           RCC_MP_NS_AHB4LPENCLRR_GPIOELPEN_Msk                /*!< GPIOE peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOFLPEN_Pos       (5U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOFLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIOFLPEN_Pos)      /*!< 0x00000020 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOFLPEN           RCC_MP_NS_AHB4LPENCLRR_GPIOFLPEN_Msk                /*!< GPIOF peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOGLPEN_Pos       (6U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOGLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIOGLPEN_Pos)      /*!< 0x00000040 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOGLPEN           RCC_MP_NS_AHB4LPENCLRR_GPIOGLPEN_Msk                /*!< GPIOG peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOHLPEN_Pos       (7U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOHLPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIOHLPEN_Pos)      /*!< 0x00000080 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOHLPEN           RCC_MP_NS_AHB4LPENCLRR_GPIOHLPEN_Msk                /*!< GPIOH peripheral clocks enable during CSleep mode Cleared by software. */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOILPEN_Pos       (8U)
#define RCC_MP_NS_AHB4LPENCLRR_GPIOILPEN_Msk       (0x1UL << RCC_MP_NS_AHB4LPENCLRR_GPIOILPEN_Pos)      /*!< 0x00000100 */
#define RCC_MP_NS_AHB4LPENCLRR_GPIOILPEN           RCC_MP_NS_AHB4LPENCLRR_GPIOILPEN_Msk                /*!< GPIOI peripheral clocks enable during CSleep mode Cleared by software. */

/*************  Bit definition for RCC_MP_AHB5LPENSETR register  **************/
#define RCC_MP_AHB5LPENSETR_PKALPEN_Pos            (2U)
#define RCC_MP_AHB5LPENSETR_PKALPEN_Msk            (0x1UL << RCC_MP_AHB5LPENSETR_PKALPEN_Pos)           /*!< 0x00000004 */
#define RCC_MP_AHB5LPENSETR_PKALPEN                RCC_MP_AHB5LPENSETR_PKALPEN_Msk                     /*!< PKA peripheral clocks enable during CSleep mode If PKA is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5LPENSETR_SAESLPEN_Pos           (3U)
#define RCC_MP_AHB5LPENSETR_SAESLPEN_Msk           (0x1UL << RCC_MP_AHB5LPENSETR_SAESLPEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_AHB5LPENSETR_SAESLPEN               RCC_MP_AHB5LPENSETR_SAESLPEN_Msk                    /*!< SAES peripheral clocks enable during CSleep mode If SAES is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5LPENSETR_CRYP1LPEN_Pos          (4U)
#define RCC_MP_AHB5LPENSETR_CRYP1LPEN_Msk          (0x1UL << RCC_MP_AHB5LPENSETR_CRYP1LPEN_Pos)         /*!< 0x00000010 */
#define RCC_MP_AHB5LPENSETR_CRYP1LPEN              RCC_MP_AHB5LPENSETR_CRYP1LPEN_Msk                   /*!< CRYP (3DES/AES) peripheral clocks enable during CSleep mode If CRYP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5LPENSETR_HASH1LPEN_Pos          (5U)
#define RCC_MP_AHB5LPENSETR_HASH1LPEN_Msk          (0x1UL << RCC_MP_AHB5LPENSETR_HASH1LPEN_Pos)         /*!< 0x00000020 */
#define RCC_MP_AHB5LPENSETR_HASH1LPEN              RCC_MP_AHB5LPENSETR_HASH1LPEN_Msk                   /*!< HASH peripheral clocks enable during CSleep mode If HASH is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5LPENSETR_RNG1LPEN_Pos           (6U)
#define RCC_MP_AHB5LPENSETR_RNG1LPEN_Msk           (0x1UL << RCC_MP_AHB5LPENSETR_RNG1LPEN_Pos)          /*!< 0x00000040 */
#define RCC_MP_AHB5LPENSETR_RNG1LPEN               RCC_MP_AHB5LPENSETR_RNG1LPEN_Msk                    /*!< RNG1 peripheral clocks enable during CSleep mode If RNG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */
#define RCC_MP_AHB5LPENSETR_BKPSRAMLPEN_Pos        (8U)
#define RCC_MP_AHB5LPENSETR_BKPSRAMLPEN_Msk        (0x1UL << RCC_MP_AHB5LPENSETR_BKPSRAMLPEN_Pos)       /*!< 0x00000100 */
#define RCC_MP_AHB5LPENSETR_BKPSRAMLPEN            RCC_MP_AHB5LPENSETR_BKPSRAMLPEN_Msk                 /*!< BKPSRAM clocks enable during CSleep mode If BKPSRAM is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Set by software. */

/*************  Bit definition for RCC_MP_AHB5LPENCLRR register  **************/
#define RCC_MP_AHB5LPENCLRR_PKALPEN_Pos            (2U)
#define RCC_MP_AHB5LPENCLRR_PKALPEN_Msk            (0x1UL << RCC_MP_AHB5LPENCLRR_PKALPEN_Pos)           /*!< 0x00000004 */
#define RCC_MP_AHB5LPENCLRR_PKALPEN                RCC_MP_AHB5LPENCLRR_PKALPEN_Msk                     /*!< PKA peripheral clocks enable during CSleep mode If PKA is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5LPENCLRR_SAESLPEN_Pos           (3U)
#define RCC_MP_AHB5LPENCLRR_SAESLPEN_Msk           (0x1UL << RCC_MP_AHB5LPENCLRR_SAESLPEN_Pos)          /*!< 0x00000008 */
#define RCC_MP_AHB5LPENCLRR_SAESLPEN               RCC_MP_AHB5LPENCLRR_SAESLPEN_Msk                    /*!< SAES peripheral clocks enable during CSleep mode If SAES is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5LPENCLRR_CRYP1LPEN_Pos          (4U)
#define RCC_MP_AHB5LPENCLRR_CRYP1LPEN_Msk          (0x1UL << RCC_MP_AHB5LPENCLRR_CRYP1LPEN_Pos)         /*!< 0x00000010 */
#define RCC_MP_AHB5LPENCLRR_CRYP1LPEN              RCC_MP_AHB5LPENCLRR_CRYP1LPEN_Msk                   /*!< CRYP (3DES/AES) peripheral clocks enable during CSleep mode If CRYP is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5LPENCLRR_HASH1LPEN_Pos          (5U)
#define RCC_MP_AHB5LPENCLRR_HASH1LPEN_Msk          (0x1UL << RCC_MP_AHB5LPENCLRR_HASH1LPEN_Pos)         /*!< 0x00000020 */
#define RCC_MP_AHB5LPENCLRR_HASH1LPEN              RCC_MP_AHB5LPENCLRR_HASH1LPEN_Msk                   /*!< HASH peripheral clocks enable during CSleep mode If HASH is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5LPENCLRR_RNG1LPEN_Pos           (6U)
#define RCC_MP_AHB5LPENCLRR_RNG1LPEN_Msk           (0x1UL << RCC_MP_AHB5LPENCLRR_RNG1LPEN_Pos)          /*!< 0x00000040 */
#define RCC_MP_AHB5LPENCLRR_RNG1LPEN               RCC_MP_AHB5LPENCLRR_RNG1LPEN_Msk                    /*!< RNG1 peripheral clocks enable during CSleep mode If RNG1 is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */
#define RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN_Pos        (8U)
#define RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN_Msk        (0x1UL << RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN_Pos)       /*!< 0x00000100 */
#define RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN            RCC_MP_AHB5LPENCLRR_BKPSRAMLPEN_Msk                 /*!< BKPSRAM clocks enable during CSleep mode If BKPSRAM is configured as secure via the corresponding DECPROT[1] field of the ETZPC register, a write access to this register field must be secure. A read access may be secure or non-secure. Cleared by software. */

