zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
/********************  Bit definition for USB_OTG_GINTMSK register  ********************/
#define USB_OTG_GINTMSK_MMISM_Pos              (1U)
#define USB_OTG_GINTMSK_MMISM_Msk              (0x1UL << USB_OTG_GINTMSK_MMISM_Pos)         /*!< 0x00000002 */
#define USB_OTG_GINTMSK_MMISM                  USB_OTG_GINTMSK_MMISM_Msk                   /*!< Mode mismatch interrupt mask */
#define USB_OTG_GINTMSK_OTGINT_Pos             (2U)
#define USB_OTG_GINTMSK_OTGINT_Msk             (0x1UL << USB_OTG_GINTMSK_OTGINT_Pos)        /*!< 0x00000004 */
#define USB_OTG_GINTMSK_OTGINT                 USB_OTG_GINTMSK_OTGINT_Msk                  /*!< OTG interrupt mask */
#define USB_OTG_GINTMSK_SOFM_Pos               (3U)
#define USB_OTG_GINTMSK_SOFM_Msk               (0x1UL << USB_OTG_GINTMSK_SOFM_Pos)          /*!< 0x00000008 */
#define USB_OTG_GINTMSK_SOFM                   USB_OTG_GINTMSK_SOFM_Msk                    /*!< Start of frame mask */
#define USB_OTG_GINTMSK_RXFLVLM_Pos            (4U)
#define USB_OTG_GINTMSK_RXFLVLM_Msk            (0x1UL << USB_OTG_GINTMSK_RXFLVLM_Pos)       /*!< 0x00000010 */
#define USB_OTG_GINTMSK_RXFLVLM                USB_OTG_GINTMSK_RXFLVLM_Msk                 /*!< Receive FIFO non-empty mask */
#define USB_OTG_GINTMSK_NPTXFEM_Pos            (5U)
#define USB_OTG_GINTMSK_NPTXFEM_Msk            (0x1UL << USB_OTG_GINTMSK_NPTXFEM_Pos)       /*!< 0x00000020 */
#define USB_OTG_GINTMSK_NPTXFEM                USB_OTG_GINTMSK_NPTXFEM_Msk                 /*!< Non-periodic Tx FIFO empty mask */
#define USB_OTG_GINTMSK_GINAKEFFM_Pos          (6U)
#define USB_OTG_GINTMSK_GINAKEFFM_Msk          (0x1UL << USB_OTG_GINTMSK_GINAKEFFM_Pos)     /*!< 0x00000040 */
#define USB_OTG_GINTMSK_GINAKEFFM              USB_OTG_GINTMSK_GINAKEFFM_Msk               /*!< Global non-periodic IN NAK effective mask */
#define USB_OTG_GINTMSK_GONAKEFFM_Pos          (7U)
#define USB_OTG_GINTMSK_GONAKEFFM_Msk          (0x1UL << USB_OTG_GINTMSK_GONAKEFFM_Pos)     /*!< 0x00000080 */
#define USB_OTG_GINTMSK_GONAKEFFM              USB_OTG_GINTMSK_GONAKEFFM_Msk               /*!< Global OUT NAK effective mask */
#define USB_OTG_GINTMSK_ESUSPM_Pos             (10U)
#define USB_OTG_GINTMSK_ESUSPM_Msk             (0x1UL << USB_OTG_GINTMSK_ESUSPM_Pos)        /*!< 0x00000400 */
#define USB_OTG_GINTMSK_ESUSPM                 USB_OTG_GINTMSK_ESUSPM_Msk                  /*!< Early suspend mask */
#define USB_OTG_GINTMSK_USBSUSPM_Pos           (11U)
#define USB_OTG_GINTMSK_USBSUSPM_Msk           (0x1UL << USB_OTG_GINTMSK_USBSUSPM_Pos)      /*!< 0x00000800 */
#define USB_OTG_GINTMSK_USBSUSPM               USB_OTG_GINTMSK_USBSUSPM_Msk                /*!< USB suspend mask */
#define USB_OTG_GINTMSK_USBRST_Pos             (12U)
#define USB_OTG_GINTMSK_USBRST_Msk             (0x1UL << USB_OTG_GINTMSK_USBRST_Pos)        /*!< 0x00001000 */
#define USB_OTG_GINTMSK_USBRST                 USB_OTG_GINTMSK_USBRST_Msk                  /*!< USB reset mask */
#define USB_OTG_GINTMSK_ENUMDNEM_Pos           (13U)
#define USB_OTG_GINTMSK_ENUMDNEM_Msk           (0x1UL << USB_OTG_GINTMSK_ENUMDNEM_Pos)      /*!< 0x00002000 */
#define USB_OTG_GINTMSK_ENUMDNEM               USB_OTG_GINTMSK_ENUMDNEM_Msk                /*!< Enumeration done mask */
#define USB_OTG_GINTMSK_ISOODRPM_Pos           (14U)
#define USB_OTG_GINTMSK_ISOODRPM_Msk           (0x1UL << USB_OTG_GINTMSK_ISOODRPM_Pos)      /*!< 0x00004000 */
#define USB_OTG_GINTMSK_ISOODRPM               USB_OTG_GINTMSK_ISOODRPM_Msk                /*!< Isochronous OUT packet dropped interrupt mask */
#define USB_OTG_GINTMSK_EOPFM_Pos              (15U)
#define USB_OTG_GINTMSK_EOPFM_Msk              (0x1UL << USB_OTG_GINTMSK_EOPFM_Pos)         /*!< 0x00008000 */
#define USB_OTG_GINTMSK_EOPFM                  USB_OTG_GINTMSK_EOPFM_Msk                   /*!< End of periodic frame interrupt mask */
#define USB_OTG_GINTMSK_IEPINT_Pos             (18U)
#define USB_OTG_GINTMSK_IEPINT_Msk             (0x1UL << USB_OTG_GINTMSK_IEPINT_Pos)        /*!< 0x00040000 */
#define USB_OTG_GINTMSK_IEPINT                 USB_OTG_GINTMSK_IEPINT_Msk                  /*!< IN endpoints interrupt mask */
#define USB_OTG_GINTMSK_OEPINT_Pos             (19U)
#define USB_OTG_GINTMSK_OEPINT_Msk             (0x1UL << USB_OTG_GINTMSK_OEPINT_Pos)        /*!< 0x00080000 */
#define USB_OTG_GINTMSK_OEPINT                 USB_OTG_GINTMSK_OEPINT_Msk                  /*!< OUT endpoints interrupt mask */
#define USB_OTG_GINTMSK_IISOIXFRM_Pos          (20U)
#define USB_OTG_GINTMSK_IISOIXFRM_Msk          (0x1UL << USB_OTG_GINTMSK_IISOIXFRM_Pos)     /*!< 0x00100000 */
#define USB_OTG_GINTMSK_IISOIXFRM              USB_OTG_GINTMSK_IISOIXFRM_Msk               /*!< Incomplete isochronous IN transfer mask */
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM_Pos    (21U)
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM_Msk    (0x1UL << USB_OTG_GINTMSK_PXFRM_IISOOXFRM_Pos)        /*!< 0x00200000 */
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM        USB_OTG_GINTMSK_PXFRM_IISOOXFRM_Msk                  /*!< Incomplete periodic transfer mask */
#define USB_OTG_GINTMSK_FSUSPM_Pos             (22U)
#define USB_OTG_GINTMSK_FSUSPM_Msk             (0x1UL << USB_OTG_GINTMSK_FSUSPM_Pos)        /*!< 0x00400000 */
#define USB_OTG_GINTMSK_FSUSPM                 USB_OTG_GINTMSK_FSUSPM_Msk                  /*!< Data fetch suspended mask */
#define USB_OTG_GINTMSK_RSTDETM_Pos            (23U)
#define USB_OTG_GINTMSK_RSTDETM_Msk            (0x1UL << USB_OTG_GINTMSK_RSTDETM_Pos)       /*!< 0x00800000 */
#define USB_OTG_GINTMSK_RSTDETM                USB_OTG_GINTMSK_RSTDETM_Msk                 /*!< Reset detected interrupt mask */
#define USB_OTG_GINTMSK_PRTIM_Pos              (24U)
#define USB_OTG_GINTMSK_PRTIM_Msk              (0x1UL << USB_OTG_GINTMSK_PRTIM_Pos)         /*!< 0x01000000 */
#define USB_OTG_GINTMSK_PRTIM                  USB_OTG_GINTMSK_PRTIM_Msk                   /*!< Host port interrupt mask */
#define USB_OTG_GINTMSK_HCIM_Pos               (25U)
#define USB_OTG_GINTMSK_HCIM_Msk               (0x1UL << USB_OTG_GINTMSK_HCIM_Pos)          /*!< 0x02000000 */
#define USB_OTG_GINTMSK_HCIM                   USB_OTG_GINTMSK_HCIM_Msk                    /*!< Host channels interrupt mask */
#define USB_OTG_GINTMSK_PTXFEM_Pos             (26U)
#define USB_OTG_GINTMSK_PTXFEM_Msk             (0x1UL << USB_OTG_GINTMSK_PTXFEM_Pos)        /*!< 0x04000000 */
#define USB_OTG_GINTMSK_PTXFEM                 USB_OTG_GINTMSK_PTXFEM_Msk                  /*!< Periodic Tx FIFO empty mask */
#define USB_OTG_GINTMSK_LPMINTM_Pos            (27U)
#define USB_OTG_GINTMSK_LPMINTM_Msk            (0x1UL << USB_OTG_GINTMSK_LPMINTM_Pos)       /*!< 0x08000000 */
#define USB_OTG_GINTMSK_LPMINTM                USB_OTG_GINTMSK_LPMINTM_Msk                 /*!< LPM interrupt mask */
#define USB_OTG_GINTMSK_CIDSCHGM_Pos           (28U)
#define USB_OTG_GINTMSK_CIDSCHGM_Msk           (0x1UL << USB_OTG_GINTMSK_CIDSCHGM_Pos)      /*!< 0x10000000 */
#define USB_OTG_GINTMSK_CIDSCHGM               USB_OTG_GINTMSK_CIDSCHGM_Msk                /*!< Connector ID status change mask */
#define USB_OTG_GINTMSK_DISCINT_Pos            (29U)
#define USB_OTG_GINTMSK_DISCINT_Msk            (0x1UL << USB_OTG_GINTMSK_DISCINT_Pos)       /*!< 0x20000000 */
#define USB_OTG_GINTMSK_DISCINT                USB_OTG_GINTMSK_DISCINT_Msk                 /*!< Disconnect detected interrupt mask */
#define USB_OTG_GINTMSK_SRQIM_Pos              (30U)
#define USB_OTG_GINTMSK_SRQIM_Msk              (0x1UL << USB_OTG_GINTMSK_SRQIM_Pos)         /*!< 0x40000000 */
#define USB_OTG_GINTMSK_SRQIM                  USB_OTG_GINTMSK_SRQIM_Msk                   /*!< Session request/new session detected interrupt mask */
#define USB_OTG_GINTMSK_WUIM_Pos               (31U)
#define USB_OTG_GINTMSK_WUIM_Msk               (0x1UL << USB_OTG_GINTMSK_WUIM_Pos)          /*!< 0x80000000 */
#define USB_OTG_GINTMSK_WUIM                   USB_OTG_GINTMSK_WUIM_Msk                    /*!< Resume/remote wakeup detected interrupt mask */

/********************  Bit definition for USB_OTG_DAINT register  ********************/
#define USB_OTG_DAINT_IEPINT_Pos                 (0U)
#define USB_OTG_DAINT_IEPINT_Msk                 (0xFFFFUL << USB_OTG_DAINT_IEPINT_Pos) /*!< 0x0000FFFF */
#define USB_OTG_DAINT_IEPINT                     USB_OTG_DAINT_IEPINT_Msk      /*!< IN endpoint interrupt bits  */
#define USB_OTG_DAINT_OEPINT_Pos                 (16U)
#define USB_OTG_DAINT_OEPINT_Msk                 (0xFFFFUL << USB_OTG_DAINT_OEPINT_Pos) /*!< 0xFFFF0000 */
#define USB_OTG_DAINT_OEPINT                     USB_OTG_DAINT_OEPINT_Msk      /*!< OUT endpoint interrupt bits */

/********************  Bit definition for USB_OTG_HAINTMSK register  ********************/
#define USB_OTG_HAINTMSK_HAINTM_Pos              (0U)
#define USB_OTG_HAINTMSK_HAINTM_Msk              (0xFFFFUL << USB_OTG_HAINTMSK_HAINTM_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HAINTMSK_HAINTM                  USB_OTG_HAINTMSK_HAINTM_Msk   /*!< Channel interrupt mask */

