zephyrproject-rtos/hal_stm32/stm32cube/stm32mp1xx/soc/stm32mp131fxx_ca7.h
/****************  Bit definition for USBPHYC_TUNE2 register  ****************/
#define USBPHYC_TUNE2_INCURREN_Pos       (0U)
#define USBPHYC_TUNE2_INCURREN_Msk       (0x1UL << USBPHYC_TUNE2_INCURREN_Pos)           /*!< 0x00000001 */
#define USBPHYC_TUNE2_INCURREN           USBPHYC_TUNE2_INCURREN_Msk                     /*!< The bit enables the current boosting function. */
#define USBPHYC_TUNE2_INCURRINT_Pos      (1U)
#define USBPHYC_TUNE2_INCURRINT_Msk      (0x1UL << USBPHYC_TUNE2_INCURRINT_Pos)          /*!< 0x00000002 */
#define USBPHYC_TUNE2_INCURRINT          USBPHYC_TUNE2_INCURRINT_Msk                    /*!< Current boosting value */
#define USBPHYC_TUNE2_LFSCAPEN_Pos       (2U)
#define USBPHYC_TUNE2_LFSCAPEN_Msk       (0x1UL << USBPHYC_TUNE2_LFSCAPEN_Pos)           /*!< 0x00000004 */
#define USBPHYC_TUNE2_LFSCAPEN           USBPHYC_TUNE2_LFSCAPEN_Msk                     /*!< Low full speed enable */
#define USBPHYC_TUNE2_HSDRVSLEW_Pos      (3U)
#define USBPHYC_TUNE2_HSDRVSLEW_Msk      (0x1UL << USBPHYC_TUNE2_HSDRVSLEW_Pos)          /*!< 0x00000008 */
#define USBPHYC_TUNE2_HSDRVSLEW          USBPHYC_TUNE2_HSDRVSLEW_Msk                    /*!< HS driver slew rate */
#define USBPHYC_TUNE2_HSDRVDCCUR_Pos     (4U)
#define USBPHYC_TUNE2_HSDRVDCCUR_Msk     (0x1UL << USBPHYC_TUNE2_HSDRVDCCUR_Pos)         /*!< 0x00000010 */
#define USBPHYC_TUNE2_HSDRVDCCUR         USBPHYC_TUNE2_HSDRVDCCUR_Msk                   /*!< HS driver DC level */
#define USBPHYC_TUNE2_HSDRVDCLEV_Pos     (5U)
#define USBPHYC_TUNE2_HSDRVDCLEV_Msk     (0x1UL << USBPHYC_TUNE2_HSDRVDCLEV_Pos)         /*!< 0x00000020 */
#define USBPHYC_TUNE2_HSDRVDCLEV         USBPHYC_TUNE2_HSDRVDCLEV_Msk                   /*!< HS driver DC level */
#define USBPHYC_TUNE2_HSDRVCURINCR_Pos   (6U)
#define USBPHYC_TUNE2_HSDRVCURINCR_Msk   (0x1UL << USBPHYC_TUNE2_HSDRVCURINCR_Pos)       /*!< 0x00000040 */
#define USBPHYC_TUNE2_HSDRVCURINCR       USBPHYC_TUNE2_HSDRVCURINCR_Msk                 /*!< Enable the HS driver current increase feature */
#define USBPHYC_TUNE2_FSDRVRFADJ_Pos     (7U)
#define USBPHYC_TUNE2_FSDRVRFADJ_Msk     (0x1UL << USBPHYC_TUNE2_FSDRVRFADJ_Pos)         /*!< 0x00000080 */
#define USBPHYC_TUNE2_FSDRVRFADJ         USBPHYC_TUNE2_FSDRVRFADJ_Msk                   /*!< Tuning pin to adjust the full speed rise/fall time */
#define USBPHYC_TUNE2_HSDRVRFRED_Pos     (8U)
#define USBPHYC_TUNE2_HSDRVRFRED_Msk     (0x1UL << USBPHYC_TUNE2_HSDRVRFRED_Pos)         /*!< 0x00000100 */
#define USBPHYC_TUNE2_HSDRVRFRED         USBPHYC_TUNE2_HSDRVRFRED_Msk                   /*!< High-speed rise-fall reduction enable */
#define USBPHYC_TUNE2_HSDRVCHKITRM_Pos   (9U)
#define USBPHYC_TUNE2_HSDRVCHKITRM_Msk   (0xFUL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)       /*!< 0x00001E00 */
#define USBPHYC_TUNE2_HSDRVCHKITRM       USBPHYC_TUNE2_HSDRVCHKITRM_Msk                 /*!< HS driver choke current trim */
#define USBPHYC_TUNE2_HSDRVCHKITRM_0     (0x1UL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)     /*!< 0x00000200 */
#define USBPHYC_TUNE2_HSDRVCHKITRM_1     (0x2UL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)     /*!< 0x00000400 */
#define USBPHYC_TUNE2_HSDRVCHKITRM_2     (0x4UL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)     /*!< 0x00000800 */
#define USBPHYC_TUNE2_HSDRVCHKITRM_3     (0x8UL << USBPHYC_TUNE2_HSDRVCHKITRM_Pos)    /*!< 0x00001000 */
#define USBPHYC_TUNE2_HSDRVCHKZTRM_Pos   (13U)
#define USBPHYC_TUNE2_HSDRVCHKZTRM_Msk   (0x3UL << USBPHYC_TUNE2_HSDRVCHKZTRM_Pos)       /*!< 0x00006000 */
#define USBPHYC_TUNE2_HSDRVCHKZTRM       USBPHYC_TUNE2_HSDRVCHKZTRM_Msk                 /*!< HS driver choke impedance trim */
#define USBPHYC_TUNE2_HSDRVCHKZTRM_0     (0x1UL << USBPHYC_TUNE2_HSDRVCHKZTRM_Pos)    /*!< 0x00002000 */
#define USBPHYC_TUNE2_HSDRVCHKZTRM_1     (0x2UL << USBPHYC_TUNE2_HSDRVCHKZTRM_Pos)    /*!< 0x00004000 */
#define USBPHYC_TUNE2_OTPCOMP_Pos        (15U)
#define USBPHYC_TUNE2_OTPCOMP_Msk        (0x1FUL << USBPHYC_TUNE2_OTPCOMP_Pos)           /*!< 0x000F8000 */
#define USBPHYC_TUNE2_OTPCOMP            USBPHYC_TUNE2_OTPCOMP_Msk                      /*!< OTP compensation code */
#define USBPHYC_TUNE2_OTPCOMP_0          (0x1UL << USBPHYC_TUNE2_OTPCOMP_Pos)         /*!< 0x00008000 */
#define USBPHYC_TUNE2_OTPCOMP_1          (0x2UL << USBPHYC_TUNE2_OTPCOMP_Pos)        /*!< 0x00010000 */
#define USBPHYC_TUNE2_OTPCOMP_2          (0x4UL << USBPHYC_TUNE2_OTPCOMP_Pos)        /*!< 0x00020000 */
#define USBPHYC_TUNE2_OTPCOMP_3          (0x8UL << USBPHYC_TUNE2_OTPCOMP_Pos)        /*!< 0x00040000 */
#define USBPHYC_TUNE2_OTPCOMP_4          (0x10UL << USBPHYC_TUNE2_OTPCOMP_Pos)        /*!< 0x00080000 */
#define USBPHYC_TUNE2_SQLCHCTL_Pos       (20U)
#define USBPHYC_TUNE2_SQLCHCTL_Msk       (0x3UL << USBPHYC_TUNE2_SQLCHCTL_Pos)           /*!< 0x00300000 */
#define USBPHYC_TUNE2_SQLCHCTL           USBPHYC_TUNE2_SQLCHCTL_Msk                     /*!< Squelch control */
#define USBPHYC_TUNE2_SQLCHCTL_0         (0x1UL << USBPHYC_TUNE2_SQLCHCTL_Pos)      /*!< 0x00100000 */
#define USBPHYC_TUNE2_SQLCHCTL_1         (0x2UL << USBPHYC_TUNE2_SQLCHCTL_Pos)      /*!< 0x00200000 */
#define USBPHYC_TUNE2_HDRXGNEQEN_Pos     (22U)
#define USBPHYC_TUNE2_HDRXGNEQEN_Msk     (0x1UL << USBPHYC_TUNE2_HDRXGNEQEN_Pos)         /*!< 0x00400000 */
#define USBPHYC_TUNE2_HDRXGNEQEN         USBPHYC_TUNE2_HDRXGNEQEN_Msk                   /*!< Enable HS Rx gain equalizer */
#define USBPHYC_TUNE2_HSRXOFF_Pos        (23U)
#define USBPHYC_TUNE2_HSRXOFF_Msk        (0x3UL << USBPHYC_TUNE2_HSRXOFF_Pos)            /*!< 0x01800000 */
#define USBPHYC_TUNE2_HSRXOFF            USBPHYC_TUNE2_HSRXOFF_Msk                      /*!< HS receiver offset adjustment */
#define USBPHYC_TUNE2_HSRXOFF_0          (0x1UL << USBPHYC_TUNE2_HSRXOFF_Pos)       /*!< 0x00800000 */
#define USBPHYC_TUNE2_HSRXOFF_1          (0x2UL << USBPHYC_TUNE2_HSRXOFF_Pos)      /*!< 0x01000000 */
#define USBPHYC_TUNE2_HSFALLPREEM_Pos    (25U)
#define USBPHYC_TUNE2_HSFALLPREEM_Msk    (0x1UL << USBPHYC_TUNE2_HSFALLPREEM_Pos)        /*!< 0x02000000 */
#define USBPHYC_TUNE2_HSFALLPREEM        USBPHYC_TUNE2_HSFALLPREEM_Msk                  /*!< HS fall time pre-emphasis */
#define USBPHYC_TUNE2_SHTCCTCTLPROT_Pos  (26U)
#define USBPHYC_TUNE2_SHTCCTCTLPROT_Msk  (0x1UL << USBPHYC_TUNE2_SHTCCTCTLPROT_Pos)      /*!< 0x04000000 */
#define USBPHYC_TUNE2_SHTCCTCTLPROT      USBPHYC_TUNE2_SHTCCTCTLPROT_Msk                /*!< Short circuit control protection */
#define USBPHYC_TUNE2_STAGSEL_Pos        (27U)
#define USBPHYC_TUNE2_STAGSEL_Msk        (0x1UL << USBPHYC_TUNE2_STAGSEL_Pos)            /*!< 0x08000000 */
#define USBPHYC_TUNE2_STAGSEL            USBPHYC_TUNE2_STAGSEL_Msk                      /*!< Staggering selection */

/****************  Bit definition for USBPHYC_VERR register  *****************/
#define USBPHYC_VERR_MINREV_Pos          (0U)
#define USBPHYC_VERR_MINREV_Msk          (0xFUL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x0000000F */
#define USBPHYC_VERR_MINREV              USBPHYC_VERR_MINREV_Msk                        /*!< Minor revision */
#define USBPHYC_VERR_MINREV_0            (0x1UL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x00000001 */
#define USBPHYC_VERR_MINREV_1            (0x2UL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x00000002 */
#define USBPHYC_VERR_MINREV_2            (0x4UL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x00000004 */
#define USBPHYC_VERR_MINREV_3            (0x8UL << USBPHYC_VERR_MINREV_Pos)              /*!< 0x00000008 */
#define USBPHYC_VERR_MAJREV_Pos          (4U)
#define USBPHYC_VERR_MAJREV_Msk          (0xFUL << USBPHYC_VERR_MAJREV_Pos)              /*!< 0x000000F0 */
#define USBPHYC_VERR_MAJREV              USBPHYC_VERR_MAJREV_Msk                        /*!< Major revision */
#define USBPHYC_VERR_MAJREV_0            (0x1UL << USBPHYC_VERR_MAJREV_Pos)             /*!< 0x00000010 */
#define USBPHYC_VERR_MAJREV_1            (0x2UL << USBPHYC_VERR_MAJREV_Pos)             /*!< 0x00000020 */
#define USBPHYC_VERR_MAJREV_2            (0x4UL << USBPHYC_VERR_MAJREV_Pos)             /*!< 0x00000040 */
#define USBPHYC_VERR_MAJREV_3            (0x8UL << USBPHYC_VERR_MAJREV_Pos)             /*!< 0x00000080 */


/******************************************************************************/
/*                                                                            */
/*                   ETZPC                                                    */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for ETZPC_TZMA0_SIZE register ****************/
#define ETZPC_TZMA0_SIZE_ROSIZE_Pos           (0U)
#define ETZPC_TZMA0_SIZE_ROSIZE_Msk           (0x3ffUL << ETZPC_TZMA0_SIZE_ROSIZE_Pos) /*!< Define the size of the secure ROM at low address and non-secure at high (4K Bytes step: 0x00 = fully unsecure, 0x20 = 128K Bytes secure)*/
#define ETZPC_TZMA0_SIZE_ROSIZE               ETZPC_TZMA0_SIZE_ROSIZE_Msk
#define ETZPC_TZMA0_SIZE_LOCK_Pos             (31U)
#define ETZPC_TZMA0_SIZE_LOCK_Msk             (0x1UL << ETZPC_TZMA0_SIZE_LOCK_Pos) /*!< To lock ROSIZE settings of the TZMA */
#define ETZPC_TZMA0_SIZE_LOCK_OFF             (0x0UL << ETZPC_TZMA0_SIZE_LOCK_Pos) /*!< Can be written */
#define ETZPC_TZMA0_SIZE_LOCK_ON              (0x1UL << ETZPC_TZMA0_SIZE_LOCK_Pos) /*!< Cannot be modified until next reset, therefore the write to r0size is silentlty ignored. */

/****************  Bit definition for ETZPC_TZMA1_SIZE register ****************/
#define ETZPC_TZMA1_SIZE_ROSIZE_Pos           (0U)
#define ETZPC_TZMA1_SIZE_ROSIZE_Msk           (0x3FFUL << ETZPC_TZMA1_SIZE_ROSIZE_Pos) /*!< Define the size of the secure RAM at low address and non-secure at high (4K Bytes step: 0x00 = fully unsecure, 0x20 = 128K Bytes secure)*/
#define ETZPC_TZMA1_SIZE_ROSIZE               ETZPC_TZMA1_SIZE_ROSIZE_Msk
#define ETZPC_TZMA1_SIZE_LOCK_Pos             (31U)
#define ETZPC_TZMA1_SIZE_LOCK_Msk             (0x1UL << ETZPC_TZMA1_SIZE_LOCK_Pos) /*!< To lock ROSIZE settings of the TZMA */
#define ETZPC_TZMA1_SIZE_LOCK_OFF             (0x0UL << ETZPC_TZMA1_SIZE_LOCK_Pos) /*!< Can be written */
#define ETZPC_TZMA1_SIZE_LOCK_ON              (0x1UL << ETZPC_TZMA1_SIZE_LOCK_Pos) /*!< Cannot be modified until next reset, therefore the write to r0size is silentlty ignored. */

/****************  Bit definition for ETZPC_DECPROT0 register ****************/
#define ETZPC_DECPROT0_VREFBUF_Pos            (0U)
#define ETZPC_DECPROT0_VREFBUF_Msk            (0x3UL << ETZPC_DECPROT0_VREFBUF_Pos) /*!< Define security for VREFBUF */
#define ETZPC_DECPROT0_VREFBUF                ETZPC_DECPROT0_VREFBUF_Msk
#define ETZPC_DECPROT0_LPTIM2_Pos             (2U)
#define ETZPC_DECPROT0_LPTIM2_Msk             (0x3UL << ETZPC_DECPROT0_LPTIM2_Pos) /*!< Define security for LPTIM2 */
#define ETZPC_DECPROT0_LPTIM2                 ETZPC_DECPROT0_LPTIM2_Msk
#define ETZPC_DECPROT0_LPTIM3_Pos             (4U)
#define ETZPC_DECPROT0_LPTIM3_Msk             (0x3UL << ETZPC_DECPROT0_LPTIM3_Pos) /*!< Define security for LPTIM3 */
#define ETZPC_DECPROT0_LPTIM3                 ETZPC_DECPROT0_LPTIM3_Msk
#define ETZPC_DECPROT0_LTDC_Pos               (6U)
#define ETZPC_DECPROT0_LTDC_Msk               (0x3UL << ETZPC_DECPROT0_LTDC_Pos) /*!< Define security for LTDC layer 2 */
#define ETZPC_DECPROT0_LTDC                   ETZPC_DECPROT0_LTDC_Msk
#define ETZPC_DECPROT0_DCMIPP_Pos             (8U)
#define ETZPC_DECPROT0_DCMIPP_Msk             (0x3UL << ETZPC_DECPROT0_DCMIPP_Pos) /*!< Define security for DCMIPP */
#define ETZPC_DECPROT0_DCMIPP                 ETZPC_DECPROT0_DCMIPP_Msk
#define ETZPC_DECPROT0_USBPHYC_Pos            (10U)
#define ETZPC_DECPROT0_USBPHYC_Msk            (0x3UL << ETZPC_DECPROT0_USBPHYC_Pos) /*!< Define security for USBPHYC */
#define ETZPC_DECPROT0_USBPHYC                ETZPC_DECPROT0_USBPHYC_Msk
#define ETZPC_DECPROT0_DDRCTRL_Pos            (12U)
#define ETZPC_DECPROT0_DDRCTRL_Msk            (0x3UL << ETZPC_DECPROT0_DDRCTRL_Pos) /*!< Define security for DDRCTRL and DDRPHYC */
#define ETZPC_DECPROT0_DDRCTRL                ETZPC_DECPROT0_DDRCTRL_Msk
#define ETZPC_DECPROT0_IWDG1_Pos              (24U)
#define ETZPC_DECPROT0_IWDG1_Msk              (0x3UL << ETZPC_DECPROT0_IWDG1_Pos) /*!< Define security for IWDG1 */
#define ETZPC_DECPROT0_IWDG1                  ETZPC_DECPROT0_IWDG1_Msk
#define ETZPC_DECPROT0_STGENC_Pos             (26U)
#define ETZPC_DECPROT0_STGENC_Msk             (0x3UL << ETZPC_DECPROT0_STGENC_Pos) /*!< Define security for STGENC */
#define ETZPC_DECPROT0_STGENC                 ETZPC_DECPROT0_STGENC_Msk

/****************  Bit definition for ETZPC_DECPROT1 register ****************/
#define ETZPC_DECPROT1_USART1_Pos             (0U)
#define ETZPC_DECPROT1_USART1_Msk             (0x3UL << ETZPC_DECPROT1_USART1_Pos) /*!< Define security for USART1 */
#define ETZPC_DECPROT1_USART1                 ETZPC_DECPROT1_USART1_Msk
#define ETZPC_DECPROT1_USART2_Pos             (2U)
#define ETZPC_DECPROT1_USART2_Msk             (0x3UL << ETZPC_DECPROT1_USART2_Pos) /*!< Define security for USART2 */
#define ETZPC_DECPROT1_USART2                 ETZPC_DECPROT1_USART2_Msk
#define ETZPC_DECPROT1_SPI4_Pos               (4U)
#define ETZPC_DECPROT1_SPI4_Msk               (0x3UL << ETZPC_DECPROT1_SPI4_Pos) /*!< Define security for SPI4 */
#define ETZPC_DECPROT1_SPI4                   ETZPC_DECPROT1_SPI4_Msk
#define ETZPC_DECPROT1_SPI5_Pos               (6U)
#define ETZPC_DECPROT1_SPI5_Msk               (0x3UL << ETZPC_DECPROT1_SPI5_Pos) /*!< Define security for SPI5 */
#define ETZPC_DECPROT1_SPI5                   ETZPC_DECPROT1_SPI5_Msk
#define ETZPC_DECPROT1_I2C3_Pos               (8U)
#define ETZPC_DECPROT1_I2C3_Msk               (0x3UL << ETZPC_DECPROT1_I2C3_Pos) /*!< Define security for I2C3 */
#define ETZPC_DECPROT1_I2C3                   ETZPC_DECPROT1_I2C3_Msk
#define ETZPC_DECPROT1_I2C4_Pos               (10U)
#define ETZPC_DECPROT1_I2C4_Msk               (0x3UL << ETZPC_DECPROT1_I2C4_Pos) /*!< Define security for I2C4 */
#define ETZPC_DECPROT1_I2C4                   ETZPC_DECPROT1_I2C4_Msk
#define ETZPC_DECPROT1_I2C5_Pos               (12U)
#define ETZPC_DECPROT1_I2C5_Msk               (0x3UL << ETZPC_DECPROT1_I2C5_Pos) /*!< Define security for I2C5 */
#define ETZPC_DECPROT1_I2C5                   ETZPC_DECPROT1_I2C5_Msk
#define ETZPC_DECPROT1_TIM12_Pos              (14U)
#define ETZPC_DECPROT1_TIM12_Msk              (0x3UL << ETZPC_DECPROT1_TIM12_Pos) /*!< Define security for TIM12 */
#define ETZPC_DECPROT1_TIM12                  ETZPC_DECPROT1_TIM12_Msk
#define ETZPC_DECPROT1_TIM13_Pos              (16U)
#define ETZPC_DECPROT1_TIM13_Msk              (0x3UL << ETZPC_DECPROT1_TIM13_Pos) /*!< Define security for TIM13 */
#define ETZPC_DECPROT1_TIM13                  ETZPC_DECPROT1_TIM13_Msk
#define ETZPC_DECPROT1_TIM14_Pos              (18U)
#define ETZPC_DECPROT1_TIM14_Msk              (0x3UL << ETZPC_DECPROT1_TIM14_Pos) /*!< Define security for TIM14 */
#define ETZPC_DECPROT1_TIM14                  ETZPC_DECPROT1_TIM14_Msk
#define ETZPC_DECPROT1_TIM15_Pos              (20U)
#define ETZPC_DECPROT1_TIM15_Msk              (0x3UL << ETZPC_DECPROT1_TIM15_Pos) /*!< Define security for TIM15 */
#define ETZPC_DECPROT1_TIM15                  ETZPC_DECPROT1_TIM15_Msk
#define ETZPC_DECPROT1_TIM16_Pos              (22U)
#define ETZPC_DECPROT1_TIM16_Msk              (0x3UL << ETZPC_DECPROT1_TIM16_Pos) /*!< Define security for TIM16 */
#define ETZPC_DECPROT1_TIM16                  ETZPC_DECPROT1_TIM16_Msk
#define ETZPC_DECPROT1_TIM17_Pos              (24U)
#define ETZPC_DECPROT1_TIM17_Msk              (0x3UL << ETZPC_DECPROT1_TIM17_Pos) /*!< Define security for TIM17 */
#define ETZPC_DECPROT1_TIM17                  ETZPC_DECPROT1_TIM17_Msk

/****************  Bit definition for ETZPC_DECPROT2 register ****************/
#define ETZPC_DECPROT2_ADC1_Pos               (0U)
#define ETZPC_DECPROT2_ADC1_Msk               (0x3UL << ETZPC_DECPROT2_ADC1_Pos) /*!< Define security for ADC1 */
#define ETZPC_DECPROT2_ADC1                   ETZPC_DECPROT2_ADC1_Msk
#define ETZPC_DECPROT2_ADC2_Pos               (2U)
#define ETZPC_DECPROT2_ADC2_Msk               (0x3UL << ETZPC_DECPROT2_ADC2_Pos) /*!< Define security for ADC2 */
#define ETZPC_DECPROT2_ADC2                   ETZPC_DECPROT2_ADC2_Msk
#define ETZPC_DECPROT2_OTG_Pos                (4U)
#define ETZPC_DECPROT2_OTG_Msk                (0x3UL << ETZPC_DECPROT2_OTG_Pos) /*!< Define security for OTG */
#define ETZPC_DECPROT2_OTG                    ETZPC_DECPROT2_OTG_Msk
#define ETZPC_DECPROT2_RNG_Pos                (16U)
#define ETZPC_DECPROT2_RNG_Msk                (0x3UL << ETZPC_DECPROT2_RNG_Pos) /*!< Define security for RNG */
#define ETZPC_DECPROT2_RNG                    ETZPC_DECPROT2_RNG_Msk
#define ETZPC_DECPROT2_HASH_Pos               (18U)
#define ETZPC_DECPROT2_HASH_Msk               (0x3UL << ETZPC_DECPROT2_HASH_Pos) /*!< Define security for HASH */
#define ETZPC_DECPROT2_HASH                   ETZPC_DECPROT2_HASH_Msk
#define ETZPC_DECPROT2_CRYP_Pos               (20U)
#define ETZPC_DECPROT2_CRYP_Msk               (0x3UL << ETZPC_DECPROT2_CRYP_Pos) /*!< Define security for CRYP */
#define ETZPC_DECPROT2_CRYP                   ETZPC_DECPROT2_CRYP_Msk
#define ETZPC_DECPROT2_SAES_Pos               (22U)
#define ETZPC_DECPROT2_SAES_Msk               (0x3UL << ETZPC_DECPROT2_SAES_Pos) /*!< Define security for SAES */
#define ETZPC_DECPROT2_SAES                   ETZPC_DECPROT2_SAES_Msk
#define ETZPC_DECPROT2_PKA_Pos                (24U)
#define ETZPC_DECPROT2_PKA_Msk                (0x3UL << ETZPC_DECPROT2_PKA_Pos) /*!< Define security for PKA */
#define ETZPC_DECPROT2_PKA                    ETZPC_DECPROT2_PKA_Msk
#define ETZPC_DECPROT2_BKPSRAM_Pos            (26U)
#define ETZPC_DECPROT2_BKPSRAM_Msk            (0x3UL << ETZPC_DECPROT2_BKPSRAM_Pos) /*!< Define security for BKPSRAM */
#define ETZPC_DECPROT2_BKPSRAM                ETZPC_DECPROT2_BKPSRAM_Msk

